{
  "project": "nSuns 4-Day LP Workout Tracker",
  "branchName": "ralph/history-calendar-fixes",
  "description": "Fix history calendar month navigation bug, add View Transition API animations, enable parallel Playwright tests, and add zod runtime validation for frontend API responses.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Fix calendar month navigation - make WorkoutCalendar controlled",
      "description": "As a user, I want to navigate to previous and next months in the history calendar so that I can view past workouts.",
      "acceptanceCriteria": [
        "WorkoutCalendar accepts year and month as props instead of using internal useState(new Date())",
        "HistoryPage owns the displayed month state and passes it as props to WorkoutCalendar",
        "WorkoutCalendar calls onMonthChange callback when prev/next buttons are clicked, parent updates the props",
        "HistoryPage does NOT unmount the calendar during loading - instead shows a loading overlay or reduced opacity on the calendar while fetching",
        "Clicking Previous month shows the previous month's name/year and correct day grid",
        "Clicking Next month shows the next month's name/year and correct day grid",
        "Navigating across year boundaries works (e.g., January 2026 to December 2025)",
        "Selected workout detail is cleared when navigating to a different month",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Root cause: HistoryPage conditionally renders LoadingSpinner instead of WorkoutCalendar during isLoadingCalendar. When calendar remounts after loading, useState(new Date()) resets to current month. Fix by: (1) making WorkoutCalendar accept year/month props (controlled component), (2) keeping the calendar rendered during loading with an overlay. Files: frontend/src/components/WorkoutCalendar.tsx, frontend/src/components/WorkoutCalendar.css, frontend/src/pages/HistoryPage.tsx, frontend/src/pages/HistoryPage.css"
    },
    {
      "id": "US-002",
      "title": "Add View Transition API animation for month changes",
      "description": "As a user, I want smooth sliding animations when navigating between months so the calendar feels polished.",
      "acceptanceCriteria": [
        "Month navigation triggers document.startViewTransition() to animate the calendar grid",
        "Navigating to next month slides the calendar grid left (old exits left, new enters from right)",
        "Navigating to previous month slides the calendar grid right (old exits right, new enters from left)",
        "Uses CSS view-transition-name on the calendar grid and ::view-transition-old / ::view-transition-new pseudo-elements for directional animations",
        "Wrapped in feature detection: if (!document.startViewTransition) falls back to instant update with no errors",
        "Animation duration is 150-250ms (snappy, not sluggish)",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "View Transition API: supported in Chrome 111+, Safari 18+, Firefox 132+. Use document.startViewTransition(() => { /* update state */ }) pattern. Set a data attribute or CSS class for direction (prev/next) so CSS animations know which way to slide. Files: frontend/src/components/WorkoutCalendar.tsx, frontend/src/components/WorkoutCalendar.css. May need to add startViewTransition to global type declarations since TypeScript may not have it yet."
    },
    {
      "id": "US-003",
      "title": "Enable parallel Playwright E2E tests",
      "description": "As a developer, I want E2E tests to run fully in parallel so the test suite completes faster.",
      "acceptanceCriteria": [
        "playwright.config.ts sets fullyParallel: true",
        "playwright.config.ts removes workers: 1 (let Playwright auto-detect or set to a reasonable number like 4)",
        "E2E test fixture uses a more unique identifier than just Date.now() to prevent collisions (e.g., add random suffix or use crypto.randomUUID())",
        "All existing E2E tests pass when run in parallel without flakiness",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Current fixture in e2e/fixtures.ts creates unique users via Date.now() timestamps. Each test has its own user with its own data, so DB isolation is handled. Main risk is timestamp collisions when tests start simultaneously. Fix by adding random suffix to email. Files: playwright.config.ts, e2e/fixtures.ts"
    },
    {
      "id": "US-004",
      "title": "Add zod schemas for frontend API response types",
      "description": "As a developer, I want zod schemas for all API response types so that runtime validation catches mismatches between backend and frontend.",
      "acceptanceCriteria": [
        "zod is installed in the frontend workspace (npm install zod -w frontend)",
        "Create frontend/src/api/schemas.ts with zod schemas for: CalendarWorkout, Workout, WorkoutSet, WorkoutHistoryItem, ProgressionResult, CompleteWorkoutResponse",
        "TypeScript interfaces in frontend/src/api/workouts.ts are replaced with z.infer<> types derived from the zod schemas",
        "Schemas match the actual backend response shapes (check backend route handlers and service layer)",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Install zod as regular dependency (not dev) since it runs at runtime. Create schemas that match the actual backend JSON responses. Derive TS types from schemas using z.infer<typeof schema>. Files: frontend/src/api/schemas.ts (new), frontend/src/api/workouts.ts. Check backend/src/routes/workouts.ts and backend/src/services/workout.service.ts for actual response shapes."
    },
    {
      "id": "US-005",
      "title": "Add zod schemas for auth and training max API responses",
      "description": "As a developer, I want zod schemas for auth and training max API response types to complete frontend runtime validation coverage.",
      "acceptanceCriteria": [
        "Add zod schemas for: LoginResponse (token + user), User, TrainingMax, TrainingMaxHistory, SetupResponse",
        "TypeScript interfaces in frontend/src/api/auth.ts and frontend/src/api/training-maxes.ts are replaced with z.infer<> types",
        "Schemas match the actual backend response shapes",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Check backend/src/routes/auth.ts and backend/src/routes/training-maxes.ts for actual response shapes. Files: frontend/src/api/schemas.ts (extend), frontend/src/api/auth.ts, frontend/src/api/training-maxes.ts"
    },
    {
      "id": "US-006",
      "title": "Wire zod validation into all frontend API functions",
      "description": "As a developer, I want every frontend API function to parse responses through zod schemas so invalid data is caught at runtime.",
      "acceptanceCriteria": [
        "Every API function in frontend/src/api/workouts.ts parses its response through the corresponding zod schema before returning",
        "Every API function in frontend/src/api/auth.ts parses its response through the corresponding zod schema before returning",
        "Every API function in frontend/src/api/training-maxes.ts parses its response through the corresponding zod schema before returning",
        "Invalid responses throw a descriptive zod error rather than silently passing bad data",
        "All E2E tests still pass (proving schemas match actual backend responses)",
        "Typecheck passes"
      ],
      "priority": 6,
      "passes": true,
      "notes": "Use schema.parse(data) in each API function. This validates at runtime and throws ZodError if the shape doesn't match. Run E2E tests to verify schemas are correct against real backend responses. Files: frontend/src/api/workouts.ts, frontend/src/api/auth.ts, frontend/src/api/training-maxes.ts"
    },
    {
      "id": "US-007",
      "title": "Update E2E month navigation test to verify data changes",
      "description": "As a developer, I want the Playwright month navigation test to actually verify that the displayed month changes correctly.",
      "acceptanceCriteria": [
        "The month navigation test in e2e/history.spec.ts clicks Previous month and verifies the header shows the previous month's name and year",
        "Clicks Next month twice (back to current, then forward) and verifies the header shows the correct month name and year",
        "Test verifies the calendar grid re-renders (not just that it doesn't crash)",
        "Test passes in parallel with other tests",
        "Typecheck passes"
      ],
      "priority": 7,
      "passes": true,
      "notes": "Current test just clicks prev/next and checks a heading exists. Improve it to assert the actual month name changes. Use the MONTH_NAMES array to compute expected month names. Files: e2e/history.spec.ts"
    }
  ]
}
