{
  "project": "nSuns 4-Day LP Workout Tracker",
  "branchName": "ralph/epic-12-polish-edge-cases",
  "description": "Epic 12 - Polish & Edge Cases. Timestamptz migration, unit conversion for lb users, duplicate workout prevention, soft-delete discard, loading/error states, 8-point grid system, touch targets, and TypeScript type safety audit.",
  "userStories": [
    {
      "id": "US-069",
      "title": "Migrate all database timestamps to timestamptz",
      "description": "As a developer, I need all timestamp columns to use PostgreSQL timestamptz so that times are stored with timezone awareness.",
      "acceptanceCriteria": [
        "All DateTime fields in backend/prisma/schema.prisma use @db.Timestamptz(3) annotation: createdAt and updatedAt on User, createdAt on TrainingMax, createdAt and completedAt on Workout, createdAt on WorkoutSet",
        "effectiveDate on TrainingMax changes from @db.Date to @db.Timestamptz(3)",
        "Run npx prisma migrate dev from backend/ directory to generate and apply migration",
        "Existing data is preserved during migration",
        "Update calendar/history queries in backend/src/services/workout.service.ts getCalendar function to handle timestamptz for effectiveDate (adjust any date-only comparisons)",
        "All backend tests pass (run from backend/ directory)",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "This must be first since other stories depend on the schema. The getCalendar function uses date range queries that may need adjustment after effectiveDate changes from Date to Timestamptz."
    },
    {
      "id": "US-070",
      "title": "Define shared TypeScript types for unit, status, and exercise",
      "description": "As a developer, I want shared type definitions so the codebase is type-safe and consistent.",
      "acceptanceCriteria": [
        "Create frontend/src/types.ts with: export type UnitPreference = 'kg' | 'lb'; export type WorkoutStatus = 'in_progress' | 'completed' | 'discarded'; export type Exercise = 'bench' | 'squat' | 'ohp' | 'deadlift';",
        "Create backend/src/types.ts with the same types: UnitPreference, WorkoutStatus, Exercise",
        "Update the User type/interface in frontend/src/context/AuthContext.tsx to use UnitPreference instead of string for unitPreference field",
        "Update backend Zod schemas (wherever unitPreference is validated) to use z.enum(['kg', 'lb']) instead of z.string()",
        "Update workout status checks in backend/src/services/workout.service.ts to use the WorkoutStatus type",
        "Update frontend/src/api/workouts.ts types (Workout interface, CalendarWorkout) to use WorkoutStatus for status field",
        "Remove the {} as Workout cast in frontend/src/pages/HistoryPage.tsx line 75 — use a conditional render or separate loading state instead",
        "All as casts for unitPreference (e.g. user?.unitPreference as 'kg' | 'lb') should be removed by properly typing the User object",
        "Typecheck passes (run npx tsc --noEmit in both frontend/ and backend/ directories)"
      ],
      "priority": 2,
      "passes": true,
      "notes": "This must come before unit conversion stories since they depend on the UnitPreference type. Search for 'as' casts in frontend/src/ to find all instances to fix."
    },
    {
      "id": "US-071",
      "title": "Add weight conversion and rounding utilities",
      "description": "As a developer, I need utility functions to convert kg to lb and round weights properly before wiring them into UI components.",
      "acceptanceCriteria": [
        "Update frontend/src/utils/weight.ts to add: convertWeight(kg: number, unit: UnitPreference): number — returns kg unchanged for 'kg', multiplied by 2.20462 for 'lb'",
        "Add roundWeight(value: number, unit: UnitPreference): number — rounds to nearest 2.5 for kg, nearest 5 for lb",
        "Update formatWeight(weight: number, unit: UnitPreference): string — applies convertWeight then roundWeight, then returns formatted string with unit suffix",
        "Add convertToKg(value: number, unit: UnitPreference): number — converts lb input to kg (divide by 2.20462), passes kg through unchanged. This is for Setup page inputs.",
        "Import UnitPreference type from frontend/src/types.ts",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Pure utility functions with no UI changes. The conversion formula: lb = kg * 2.20462, round lb to nearest 5, round kg to nearest 2.5."
    },
    {
      "id": "US-072",
      "title": "Wire unit conversion into all UI components",
      "description": "As a user who prefers pounds, I want all displayed weights converted from kg to lb and rounded correctly.",
      "acceptanceCriteria": [
        "frontend/src/components/SetRow.tsx uses formatWeight from utils/weight.ts to display weight (it receives kg from backend, converts based on unit prop)",
        "frontend/src/components/WorkoutDetail.tsx uses formatWeight for all weight displays",
        "frontend/src/components/ProgressionBanner.tsx uses formatWeight for TM change display — shows change in user's unit (e.g. +5 lb not +2.27 kg)",
        "frontend/src/pages/DashboardPage.tsx uses formatWeight for TM display values",
        "frontend/src/pages/SetupPage.tsx: 1RM inputs accept values in user's preferred unit, converts to kg before sending to POST /api/training-maxes/setup using convertToKg utility",
        "SetupPage shows unit label next to inputs (e.g. 'kg' or 'lb') based on user preference",
        "Backend continues to store all weights in kg — no backend changes needed",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Check each component to understand how weight is currently displayed. The SetRow and WorkoutDetail already receive a unit prop. SetupPage needs the most work since inputs must accept lb and convert to kg."
    },
    {
      "id": "US-073",
      "title": "Soft-delete discard workout (backend)",
      "description": "As a developer, I need to change workout cancellation from hard delete to soft delete with 'discarded' status.",
      "acceptanceCriteria": [
        "Change cancelWorkout in backend/src/services/workout.service.ts from prisma.workout.delete() to prisma.workout.update({ data: { status: 'discarded' } })",
        "GET /api/workouts/current only returns workouts with status 'in_progress' — verify this is already the case",
        "GET /api/workouts/history excludes discarded workouts — filter to status: 'completed' only",
        "GET /api/workouts/calendar excludes discarded workouts — add status filter",
        "Backend integration test: discarding a workout sets status to 'discarded' and workout still exists in DB",
        "Backend integration test: discarded workouts don't appear in history or calendar responses",
        "Backend integration test: discarded workouts don't block starting a new workout (status: 'in_progress' check ignores 'discarded')",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 5,
      "passes": true,
      "notes": "The current cancelWorkout function at line 320 of workout.service.ts does prisma.workout.delete(). Change to update with status: 'discarded'. Check getHistory and getCalendar functions for where to add the status filter."
    },
    {
      "id": "US-074",
      "title": "Prevent duplicate in-progress workouts (backend 409 response)",
      "description": "As a developer, I need the backend to return a structured 409 error when starting a workout while one is in progress.",
      "acceptanceCriteria": [
        "In backend/src/services/workout.service.ts startWorkout function, when an in-progress workout exists, throw a structured error or return a specific error object instead of a generic error",
        "POST /api/workouts route in backend/src/routes/workouts.ts returns 409 with body { error: 'EXISTING_WORKOUT', workoutId: number, dayNumber: number } when user has an in-progress workout",
        "The existing check queries for status: 'in_progress' only (not 'discarded' or 'completed')",
        "Backend integration test: creating a second workout returns 409 with existing workout's id and dayNumber",
        "Backend integration test: after completing the first workout, a new workout can be started successfully",
        "Backend integration test: after discarding the first workout, a new workout can be started successfully",
        "Typecheck passes",
        "Tests pass"
      ],
      "priority": 6,
      "passes": true,
      "notes": "The startWorkout function already checks for existing in-progress workouts (line 58-63). Currently it throws a generic error. Change it to include workoutId and dayNumber in the error so the frontend can use them."
    },
    {
      "id": "US-075",
      "title": "Create reusable LoadingSpinner and ErrorMessage components",
      "description": "As a developer, I need shared loading and error components before wiring them into all pages.",
      "acceptanceCriteria": [
        "Create frontend/src/components/LoadingSpinner.tsx — CSS-only spinner, 32x32px, centered in parent container",
        "Create frontend/src/components/LoadingSpinner.css — border-based rotating circle animation, uses var(--primary) color",
        "Create frontend/src/components/ErrorMessage.tsx — shows red error text with optional retry button, uses role='alert' for accessibility",
        "Create frontend/src/components/ErrorMessage.css — red text using var(--danger), 16px padding, 8px gap between text and retry button",
        "ErrorMessage props: message (string), onRetry (optional callback function). If onRetry is provided, show a 'Retry' button",
        "LoadingSpinner props: size (optional, default 32). No other props needed.",
        "Both components follow 8-point grid spacing",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 7,
      "passes": true,
      "notes": "These are standalone components with no page integration yet. Keep them simple. The spinner should use @keyframes spin with border animation."
    },
    {
      "id": "US-076",
      "title": "Add loading and error states to auth and setup pages",
      "description": "As a user, I want loading feedback and error messages on login, register, and setup pages.",
      "acceptanceCriteria": [
        "Import and use LoadingSpinner and ErrorMessage components in affected pages",
        "LoginPage (frontend/src/pages/LoginPage.tsx): button shows 'Logging in...' and is disabled during submission, ErrorMessage shown on failure",
        "RegisterPage (frontend/src/pages/RegisterPage.tsx): button shows 'Creating account...' and is disabled during submission, ErrorMessage shown on failure",
        "SetupPage (frontend/src/pages/SetupPage.tsx): button shows 'Saving...' and is disabled during submission, ErrorMessage shown on failure",
        "All error messages use the shared ErrorMessage component instead of inline error text",
        "Buttons are disabled during async operations to prevent double-submit",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 8,
      "passes": true,
      "notes": "Check each page's current error handling. Some may already have inline error display that needs to be replaced with the shared ErrorMessage component."
    },
    {
      "id": "US-077",
      "title": "Add loading and error states to dashboard, history, and settings pages",
      "description": "As a user, I want loading spinners and error states with retry on all main app pages.",
      "acceptanceCriteria": [
        "DashboardPage (frontend/src/pages/DashboardPage.tsx): LoadingSpinner while fetching TMs and workout status, ErrorMessage with onRetry callback on failure",
        "HistoryPage (frontend/src/pages/HistoryPage.tsx): replace inline 'Loading calendar...' text with LoadingSpinner component, add ErrorMessage with retry for calendar fetch failure, LoadingSpinner for workout detail loading",
        "SettingsPage (frontend/src/pages/SettingsPage.tsx): LoadingSpinner during save operation, ErrorMessage on failure",
        "WorkoutPage (frontend/src/pages/WorkoutPage.tsx): replace inline loading/error text with shared LoadingSpinner and ErrorMessage components",
        "All loading spinners are centered and visually consistent across pages",
        "All error messages use role='alert' via the shared ErrorMessage component",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 9,
      "passes": true,
      "notes": "WorkoutPage already has loading/error states (lines 200-229) but uses inline text. Replace with shared components."
    },
    {
      "id": "US-078",
      "title": "Handle duplicate workout gracefully (frontend conflict dialog)",
      "description": "As a user, when I try to start a workout but already have one in progress, I want a clear choice: continue existing or discard and start fresh.",
      "acceptanceCriteria": [
        "Create frontend/src/components/ConflictDialog.tsx — a modal overlay with two action buttons",
        "Create frontend/src/components/ConflictDialog.css — modal overlay styling with 8-point grid spacing (padding 24px, gap 16px, button min-height 44px)",
        "ConflictDialog props: existingDayNumber (number), onContinue (callback), onDiscard (callback), onClose (callback)",
        "Dialog text: 'You have a Day X workout in progress. What would you like to do?'",
        "Two buttons: 'Continue Day X' (primary) and 'Discard & Start New' (secondary/danger)",
        "Modal has a semi-transparent backdrop overlay that closes dialog on click",
        "In WorkoutPage.tsx: when starting a workout and getting a 409 response with EXISTING_WORKOUT error, parse the response and show ConflictDialog instead of the current error message",
        "'Continue' navigates to /workout/{existingDayNumber}",
        "'Discard & Start New' calls cancelWorkout API for existing workout, then starts the new workout",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 10,
      "passes": true,
      "notes": "The current WorkoutPage handles duplicate workouts at line 63-74 by showing an error message. Replace that flow with the new 409 response handling and ConflictDialog."
    },
    {
      "id": "US-079",
      "title": "Add CSS spacing custom properties and 8-point grid system",
      "description": "As a developer, I need consistent spacing tokens and the 8-point grid applied across all CSS files.",
      "acceptanceCriteria": [
        "Add to frontend/src/styles/global.css :root block: --space-xs: 4px; --space-sm: 8px; --space-md: 16px; --space-lg: 24px; --space-xl: 32px;",
        "Audit and update all CSS files to use 8px-multiple spacing: replace arbitrary padding/margin values with multiples of 8 (8, 16, 24, 32, 40, 48). 4px allowed only for tight internal spacing.",
        "Update border-radius to be consistent: 8px for cards and buttons, 4px for small elements",
        "Gap values in flex/grid layouts should use 8px multiples (8px, 16px, 24px)",
        "Font sizes follow a clear scale: 14px (small/muted), 16px (body), 20px (subheading), 24px (heading)",
        "All interactive elements (buttons, links, inputs, calendar cells, set row toggles, AmrapInput +/- buttons) have min-height: 44px",
        "AmrapInput +/- buttons in frontend/src/components/AmrapInput.css are at least 44x44px",
        "Calendar day cells in frontend/src/components/WorkoutCalendar.css are at least 44x44px",
        "SetRow completion area in frontend/src/components/SetRow.css is at least 44x44px",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 11,
      "passes": true,
      "notes": "This is a CSS-only audit. Go through each CSS file in frontend/src/: global.css, AmrapInput.css, ProgressionBanner.css, SetRow.css, WorkoutCard.css, WorkoutCalendar.css, WorkoutDetail.css, DashboardPage.css, SetupPage.css, WorkoutPage.css, HistoryPage.css. Check padding, margin, gap, font-size, min-height values."
    },
    {
      "id": "US-080",
      "title": "E2E tests for unit conversion and lb user flow",
      "description": "As a developer, I need E2E tests verifying lb users see correctly converted and rounded weights.",
      "acceptanceCriteria": [
        "Create e2e/unit-conversion.spec.ts with Playwright tests",
        "Test 1: Register a user with unitPreference 'lb', set up 1RM values in lb, verify the setup page accepts lb values",
        "Test 2: As lb user, start a Day 1 workout, verify displayed weights are in lb and rounded to nearest 5",
        "Test 3: As lb user, verify dashboard shows TMs in lb",
        "All existing E2E tests still pass",
        "Typecheck passes"
      ],
      "priority": 12,
      "passes": false,
      "notes": "Registration endpoint accepts unitPreference. The register helper in E2E tests may need updating to support passing unitPreference. Check e2e/ directory for existing patterns."
    },
    {
      "id": "US-081",
      "title": "E2E tests for duplicate workout conflict and discard flow",
      "description": "As a developer, I need E2E tests verifying the duplicate workout dialog and discard behavior.",
      "acceptanceCriteria": [
        "Create e2e/duplicate-workout.spec.ts with Playwright tests",
        "Test 1: Start a Day 1 workout, navigate to dashboard, try to start Day 2 — verify conflict dialog appears",
        "Test 2: From conflict dialog, click 'Continue Day 1' — verify navigation to Day 1 workout page",
        "Test 3: From conflict dialog, click 'Discard & Start New' — verify old workout is discarded and new workout starts",
        "Test 4: Discard a workout, navigate to History — verify discarded workout does not appear in calendar",
        "All existing E2E tests still pass",
        "Typecheck passes"
      ],
      "priority": 13,
      "passes": false,
      "notes": "These tests depend on the ConflictDialog (US-078) and soft-delete (US-073) being implemented. The dialog is a custom modal, not window.confirm, so use regular Playwright selectors to interact with it."
    }
  ]
}
