[
  {
    "id": "111",
    "title": "Backend feed endpoint fetches ALL comments unbounded — add LIMIT or take-last-2 in DB query instead of in-memory slice",
    "status": "backlog",
    "priority": "medium",
    "description": "GET /api/social/feed batch-fetches ALL comments for up to 20 events with no LIMIT. In the worst case this could be thousands of rows. The backend should instead use a ranked subquery or window function to fetch only the 2 most recent comments per event at the DB level, not slice in memory."
  },
  {
    "id": "113",
    "title": "SocialContent.tsx component is now a dead code orphan — social route was refactored to sub-routes but SocialContent was not deleted",
    "status": "backlog",
    "priority": "low",
    "description": "After converting social.tsx to a layout route with sub-routes in ticket 108, the SocialContent component (frontend/src/components/SocialContent.tsx) is no longer imported by any route. It remains in the codebase as dead code. The social.tsx route layout now imports SocialContent.module.css directly. SocialContent.tsx itself can be deleted."
  },
  {
    "id": "114",
    "title": "docs/api-endpoints.md push payload section is missing: url field documentation, friend_request_received event type, and workout_completed/achievement_earned push notifications to friends/self",
    "status": "backlog",
    "priority": "low",
    "description": "After ticket 108, the push notification payload format now includes a url field and the push event table is missing friend_request_received. The workouts route handler now also sends push notifications to friends on workout completion, and to self on achievement, which are undocumented. The SSE event table in docs/api-endpoints.md is also missing friend_request_received."
  },
  {
    "id": "115",
    "title": "Remove orphaned SocialContent.tsx component after sub-route refactor",
    "status": "backlog",
    "priority": "low",
    "description": "SocialContent.tsx and its CSS are no longer imported after the social sub-route refactor in ticket 108. Delete the file."
  },
  {
    "id": "119",
    "title": "auth.ts: email-exists P2002 guard still uses raw object check instead of isPrismaError()",
    "status": "backlog",
    "priority": "low",
    "description": "The username-exists branch in auth.ts register handler correctly uses isP2002UsernameViolation, but the fallback email-exists branch (line 35) uses a hand-rolled check (err && 'code' in err && err.code === 'P2002') instead of the new isPrismaError() helper. Should be replaced for consistency."
  },
  {
    "id": "120",
    "title": "auth.ts email-exists P2002 guard uses raw object check instead of isPrismaError",
    "status": "backlog",
    "description": "In auth.ts POST /register, the username-exists branch uses isP2002UsernameViolation() but the email-exists fallthrough at line 35 still does a raw object check (err.code === P2002). Should use isPrismaError(err, P2002) for consistency."
  },
  {
    "id": "121",
    "title": "Fix ApiError to preserve error.code from server responses",
    "status": "backlog",
    "description": "Currently apiFetch discards the code field when constructing ApiError, making code-based error handling impossible in UI (e.g. USERNAME_EXISTS check in settings.tsx)"
  },
  {
    "id": "122",
    "title": "Fix flaky social test: 'no longer shows in pending requests after acceptance' gets 404 intermittently",
    "status": "backlog",
    "description": "The test at social.test.ts:165 calls GET /api/social/requests but intermittently receives 404 instead of 200. The route exists and has no 404 code path, suggesting a race condition or Express 5 routing issue. All ticket 117 changes are frontend-only — this is a pre-existing backend test fragility."
  },
  {
    "id": "070",
    "title": "Missing negative test for century-club achievement (low TM should not unlock)",
    "status": "backlog",
    "priority": "low",
    "description": "The achievements test suite has a positive test for century-club (bench TM=200) but no negative test confirming it does NOT trigger when all set weights are below 100 kg. The default benchTM=100 users (TM=90) could serve as a negative baseline."
  },
  {
    "id": "061",
    "title": "Shareable Workout Card",
    "status": "backlog",
    "description": "Generate a screenshot-ready card after completing a workout showing: exercises, top sets, total volume, PRs hit, workout duration. Styled with SetForge branding. Share via native share API or download as image. Great for Instagram stories."
  },
  {
    "id": "057",
    "title": "Nudge / Poke Friend",
    "status": "backlog",
    "description": "Send a 'get to the gym' nudge to a friend who hasn't trained in X days. One-tap from the friends list. Recipient sees it as a feed event or in-app notification. Rate-limited to 1 nudge per friend per day to prevent spam."
  },
  {
    "id": "062",
    "title": "User Profile Page",
    "status": "backlog",
    "description": "Public-ish profile page showing: display name, member since date, current plan, lift stats summary (current TMs or e1RMs), workout streak, badges earned, total workouts completed. Viewable by friends. Foundation for social identity in the app."
  },
  {
    "id": "051",
    "title": "Progression Race",
    "status": "backlog",
    "description": "Compare TM progression charts side-by-side with a friend over a selectable time range (30d/90d/all). Pick an exercise and see who's progressing faster. Visual overlay chart on the existing progress page or a dedicated comparison view."
  },
  {
    "id": "063",
    "title": "Invite Link for Friend Requests",
    "status": "backlog",
    "description": "Generate a unique invite link (e.g. setforge.app/invite/abc123) that auto-sends a friend request when the invitee registers. Easier than sharing email addresses. Link expires after 7 days or first use. Shareable via native share API."
  },
  {
    "id": "064",
    "title": "PR Celebration Post",
    "status": "backlog",
    "description": "When a user hits a personal record (requires PR Detection #008), auto-generate a celebratory feed event with confetti animation. Shows the lift, weight, reps, and how it compares to previous best. Friends see it prominently in their feed."
  },
  {
    "id": "060",
    "title": "Gym Crew / Groups",
    "status": "backlog",
    "description": "Create a named group of friends (a 'crew') that shares its own leaderboard and activity feed. Good for real-life gym groups or online communities running the same plan. Crew has a name, members, shared leaderboard, and crew feed."
  },
  {
    "id": "059",
    "title": "Accountability Partner",
    "status": "backlog",
    "description": "Pair with one friend as an accountability partner. Both get notified when the other skips a scheduled workout day. Opt-in mutual agreement. Shows partner's schedule and completion status on your dashboard. Designed for casual users who need external motivation."
  },
  {
    "id": "067",
    "title": "Weekly Activity Digest",
    "status": "backlog",
    "description": "Weekly summary of friends' activity delivered as a feed event or dedicated view every Sunday. Shows: who trained most, biggest TM jumps, longest active streaks, total group volume. Gives casual users a reason to check in even if they don't open the app daily."
  },
  {
    "id": "034",
    "title": "Rage Quit Button",
    "status": "backlog",
    "description": "Bad day? Slam a big red button that discards the workout with a dramatic animation and a random encouraging quote. Uses existing soft-delete (discarded status) under the hood."
  },
  {
    "id": "032",
    "title": "Workout Wrapped",
    "status": "backlog",
    "description": "Monthly/yearly Spotify Wrapped-style summary. Total tonnage lifted, favorite day of week, longest streak, biggest PR, fun comparisons ('You lifted the equivalent of 3 Toyota Corollas this month'). Shareable summary cards."
  },
  {
    "id": "031",
    "title": "Plate Math Speed Challenge",
    "status": "backlog",
    "description": "Mini-game: given a target weight, tap the plates to load the bar as fast as possible. Leaderboard against yourself. Trains useful gym math skills. Frontend-only game mode."
  },
  {
    "id": "033",
    "title": "Form Check Reminder",
    "status": "backlog",
    "description": "Every N workouts at a given weight, nudge: 'You have been at 100kg bench for 6 sessions. Film a form check?' Links to camera. No AI analysis, just the reminder habit to encourage good form."
  },
  {
    "id": "014",
    "title": "Quick Rep Edit",
    "status": "backlog",
    "description": "Improve rep entry UX with bigger +/- buttons or a number spinner directly on set rows. Current entry feels like too many taps, especially with sweaty hands between sets."
  },
  {
    "id": "017",
    "title": "Set Completion Haptic",
    "status": "backlog",
    "description": "Vibration or sound feedback when a set is logged. Confirms the tap registered, especially useful with sweaty/chalky hands or dim screens."
  },
  {
    "id": "006",
    "title": "Workout Progress Indicator",
    "status": "backlog",
    "description": "Progress bar and set counter at top of workout page showing 'X / 17 sets completed'. Bar fills as sets complete, color transitions gray to blue to green. Frontend-only, derived from existing set data."
  },
  {
    "id": "018",
    "title": "Recent Workout Peek",
    "status": "backlog",
    "description": "Before starting a workout, show a summary of last session for that day: key weights and reps. Helps users mentally prepare and know what to expect."
  },
  {
    "id": "020",
    "title": "Set Weight Override",
    "status": "backlog",
    "description": "Override auto-calculated weight for individual sets during a workout. For when plates don't work out cleanly at your gym, or you want to be conservative on a bad day. Avoids having to change the TM for one-off adjustments."
  },
  {
    "id": "016",
    "title": "Workout Duration",
    "status": "backlog",
    "description": "Track and display how long each workout took. Show duration badge on history calendar entries. Helps users plan gym visits around their schedule."
  },
  {
    "id": "005",
    "title": "Dark Mode",
    "status": "backlog",
    "description": "System-aware dark mode following device preference, with manual toggle in Settings (System/Light/Dark). Redefine existing CSS custom properties under data-theme attribute. Store preference in localStorage. Instant switch, no reload."
  },
  {
    "id": "010",
    "title": "Workout Notes",
    "status": "backlog",
    "description": "Optional free-text notes on workouts. 'Add note' link on workout page opens textarea (max 500 chars), auto-saves on blur. Notes shown in history detail view. Requires new DB column and API update."
  },
  {
    "id": "023",
    "title": "Failed Set Tracking",
    "status": "backlog",
    "description": "Explicitly mark a set as failed rather than just logging low reps. Track failure patterns across sessions. Surface warnings when consecutive failures on the same weight suggest a TM reset is needed."
  },
  {
    "id": "012",
    "title": "Exercise Substitution",
    "status": "backlog",
    "description": "Swap a plan exercise for an alternative per-session or permanently. Casual users need it when equipment is taken or they have minor soreness. Power users want same TM reference and set scheme preserved, with approved alternatives per exercise."
  },
  {
    "id": "008",
    "title": "PR Detection",
    "status": "backlog",
    "description": "Detect personal records in real-time during workouts. PR = more weight at same or higher rep count than ever before for that exercise. Show animated celebration banner on AMRAP completion. New backend endpoint for per-exercise records by rep count."
  },
  {
    "id": "013",
    "title": "Effort / RPE Logging",
    "status": "backlog",
    "description": "Log perceived effort after workouts or per-set. Simple mode: post-workout Easy/Good/Hard rating. Advanced mode: per-set RPE 1-10 scale. Track trends over time to detect under-recovery or peaking."
  },
  {
    "id": "015",
    "title": "Missed Workout Reschedule",
    "status": "backlog",
    "description": "When a user skips a planned workout day, prompt them: skip it and move on, or do it today? Removes guesswork about what to do after missing a session."
  },
  {
    "id": "004",
    "title": "Plate Calculator",
    "status": "backlog",
    "description": "Tap weight on any set to see plate breakdown per side. Greedy algorithm from heaviest plate down. Configurable bar weight and available plates in Settings. Frontend-only, no backend changes."
  },
  {
    "id": "011",
    "title": "Bodyweight Tracking",
    "status": "backlog",
    "description": "Log bodyweight (daily or per-session) with a trend line chart. Casual users want weekly weigh-ins to see if training is working. Power users want daily logging, strength-to-bodyweight ratios, and correlation with TM progression."
  },
  {
    "id": "022",
    "title": "Volume Load History",
    "status": "backlog",
    "description": "Track total volume load (sets x reps x weight) per exercise per session and chart it over time. Volume load is the best proxy for training stress and hypertrophy stimulus. Surfaces plateaus that raw TM numbers miss."
  },
  {
    "id": "009",
    "title": "Deload Detection",
    "status": "backlog",
    "description": "Track AMRAP trends and suggest deload when user hits 0-1 reps on progression AMRAP for 3 consecutive workouts. Suggest 10% TM reduction with one-tap apply. New backend stall-check endpoint, no new DB tables needed."
  },
  {
    "id": "029",
    "title": "Lift Personality Quiz",
    "status": "backlog",
    "description": "After 4+ weeks of data, generate a lifter personality based on patterns: 'The Grinder' (always hits exact reps), 'The Sandbagging Overachiever' (smashes AMRAPs), 'The Ghost' (disappears then PRs). Shareable personality card."
  },
  {
    "id": "030",
    "title": "Gym Bro Trash Talk",
    "status": "backlog",
    "description": "AI-generated motivational/trash-talk notifications before workout days. 'Your bench has been stuck at 80kg for 3 weeks. Are you even trying?' Adjustable sass level from encouraging to savage."
  },
  {
    "id": "028",
    "title": "Gym Soundtrack Mode",
    "status": "backlog",
    "description": "Detect tempo of music playing (via mic permission) and pulse the UI to the beat. Rest timer syncs to song endings. Pure vibes, experimental feature."
  },
  {
    "id": "037",
    "title": "Validate URL params and query strings with Zod",
    "status": "backlog",
    "description": "Body validation is solid but params/query have gaps: (1) PATCH/DELETE /api/admin/exercises/:id have no isNaN check causing 500s, (2) All :id params allow 0 or negative values, (3) GET /api/workouts/history limit has no upper bound, (4) GET /api/workouts/calendar year has no range bounds, (5) PATCH /api/workouts/:id/sets/:setId never validates :id param. Fix: extend validate middleware or add Zod schemas for params/query on all routes."
  },
  {
    "id": "053",
    "title": "Head-to-Head Live Workout",
    "status": "backlog",
    "description": "Real-time workout comparison when two friends train the same plan day simultaneously. See each other's set completion progress live. Requires WebSocket or polling. Shows 'friend is on set 5/17' alongside your own progress."
  },
  {
    "id": "055",
    "title": "Strength Standards Comparison",
    "status": "backlog",
    "description": "Compare your lifts against population-level strength standards (beginner/intermediate/advanced/elite) based on bodyweight and sex. Uses well-known strength standard tables. Requires bodyweight input. Shows where you stand for each lift."
  },
  {
    "id": "069",
    "title": "QR Code Add Friend",
    "status": "backlog",
    "description": "Generate a personal QR code in the app that encodes your friend request link. Show it at the gym for someone to scan and instantly send a friend request. Uses invite link system (#063). No typing needed - just scan and connect."
  },
  {
    "id": "075",
    "title": "Add backend test: user cannot react to their own feed event via direct API call",
    "status": "backlog",
    "priority": "low",
    "description": "The GET /feed endpoint only shows friends' events, so a user cannot see their own events in the UI. However the POST /feed/:eventId/react endpoint only checks friendIds, not event.userId \\!== callerId. A user who knows their own feedEventId can call the react endpoint on it. While the feed won't show their own event, it's an untested edge case. Add a backend test that verifies self-reaction returns 404."
  },
  {
    "id": "076",
    "title": "Add date range filter to streak query to avoid fetching all workout history",
    "status": "backlog",
    "priority": "medium",
    "description": "getStreaksForUsers in social.ts fetches every completed workout for the given user IDs with no date bound. A user with years of history causes a large scan on every GET /api/social/friends and GET /api/social/feed call. The streak only needs the most recent contiguous block; a WHERE completedAt >= NOW() - INTERVAL '365 days' (or similar) would cap the scan with no correctness impact."
  },
  {
    "id": "090",
    "title": "Flaky tests: workout-feed-events 404 and admin-plan-editor timeout",
    "status": "backlog",
    "priority": "medium",
    "description": "Two flaky tests to investigate:\n\n1. workout-feed-events.test.ts: occasionally fails with 404 on POST /api/workouts during parallel test execution (likely a race condition in test setup). Second run passes.\n\n2. admin-plan-editor E2E: unsaved changes warning test times out on Create Account button click in admin setup phase (webkit, intermittent)."
  },
  {
    "id": "093",
    "title": "Fix push notifications: VAPID key format, subscribe schema mismatch, and button touch targets",
    "status": "backlog",
    "priority": "high",
    "description": "Push subscribe is broken in real browsers due to multiple issues. Fix all together:\n\n1. VAPID public key format: GET /api/notifications/public-key returns SPKI DER base64url (91 bytes) but PushManager.subscribe() requires raw EC point (65 bytes, 04||x||y). Real browsers throw InvalidAccessError. Fix: return raw EC point from the endpoint, or convert in frontend.\n\n2. Subscribe response schema mismatch: pushSubscribeResponseSchema expects { id, userId, endpoint, createdAt } but backend POST /subscribe returns { ok: true }. Causes ZodError on successful 201, showing 'Failed to enable notifications'. Fix: align schema to match actual API response.\n\n3. Button touch targets: PushNotificationSettings.module.css .actionBtn and .actionBtnSecondary use min-height 2.75rem instead of project-standard 3rem. Update to 3rem."
  },
  {
    "id": "103",
    "title": "Improve logging coverage across backend services",
    "status": "backlog",
    "description": "Fill gaps identified in logging analysis where entire subsystems are silent and client-facing errors go unrecorded. Specific improvements: 1) Add warn-level logging for validation failures (Zod errors) and route-level caught errors (400s, 409s). 2) Add debug-level logging in achievement, notification, and feed services. 3) Add Prisma query event logging for slow queries. 4) Log weight calculation steps at debug level."
  },
  {
    "id": "104",
    "title": "Audit frontend catch blocks for incorrect error message extraction",
    "status": "backlog",
    "description": "The register page used err.error.message instead of err.message to extract ApiError messages, causing generic fallback messages. Other catch blocks in settings.tsx, FriendsTab.tsx, and workout.$dayNumber.tsx use the same 'error' in err pattern but operate on raw response bodies (not ApiError). These should be audited to confirm they work correctly now that ApiError is used consistently via the api/client.ts layer."
  },
  {
    "id": "123",
    "title": "CustomWorkoutModal does not validate initialDate on open — future date passed by caller would bypass error state",
    "status": "backlog",
    "priority": "low",
    "description": "validateDate is only called from the onChange handler, not on modal open. If initialDate is ever a future date the modal opens with no error and Save enabled. Fix: call validateDate(initialDate) inside the open useEffect."
  }
]
