[
  {
    "id": "003",
    "title": "Progression Charts",
    "status": "done",
    "description": "New /progress page with charts: TM progression lines per lift, AMRAP performance scatter plot, workout frequency heatmap. Time range selector (1M/3M/6M/All). New backend endpoint for AMRAP history. Lightweight chart library (uPlot or similar)."
  },
  {
    "id": "024",
    "title": "Workout History Refinement",
    "status": "planned",
    "description": "Improve the workout history view: better readability and visual design, ability to delete old workouts, and overall UI/UX polish. Current history is hard to read and lacks basic management features."
  },
  {
    "id": "001",
    "title": "Rest Timer",
    "status": "done",
    "description": "Configurable rest timer that auto-starts on set completion with countdown display, adjust/skip controls, and settings for duration."
  },
  {
    "id": "007",
    "title": "Screen Wake Lock",
    "status": "done",
    "description": "Keep screen on during active workouts using the Screen Wake Lock API. Auto-acquire on workout page mount, release on leave/complete. Re-acquire on visibilitychange for iOS. No UI needed, graceful no-op on unsupported browsers."
  },
  {
    "id": "025",
    "title": "Dynamic exercise list on Progress page",
    "status": "done",
    "description": "The Progress page currently hardcodes 4 exercises (Bench, Squat, OHP, Deadlift) in EXERCISE_CONFIGS. Make the exercise list dynamic, driven by the active plan's exercises. This way if a user subscribes to a plan with different exercises, the Progress page adapts automatically."
  },
  {
    "id": "026",
    "title": "Plan switch marker on progression chart",
    "status": "backlog",
    "description": "When a user switches plans, TM values may not be directly comparable (e.g. different TM percentages). Add a visual vertical marker on the progression chart showing when a plan switch occurred, so users understand context for any jumps or drops in TM values."
  },
  {
    "id": "027",
    "title": "Achievement Badges",
    "status": "backlog",
    "description": "Unlock badges for workout milestones. Examples: 'Century Club' (100kg lift), 'Iron Streak' (4 weeks no missed days), 'AMRAP King' (+5 reps on progression set), 'Sunrise Grinder' (workout before 7am). Shareable badge cards. Requires defining achievement criteria, detection logic, and a display page."
  },
  {
    "id": "034",
    "title": "Rage Quit Button",
    "status": "backlog",
    "description": "Bad day? Slam a big red button that discards the workout with a dramatic animation and a random encouraging quote. Uses existing soft-delete (discarded status) under the hood."
  },
  {
    "id": "032",
    "title": "Workout Wrapped",
    "status": "backlog",
    "description": "Monthly/yearly Spotify Wrapped-style summary. Total tonnage lifted, favorite day of week, longest streak, biggest PR, fun comparisons ('You lifted the equivalent of 3 Toyota Corollas this month'). Shareable summary cards."
  },
  {
    "id": "031",
    "title": "Plate Math Speed Challenge",
    "status": "backlog",
    "description": "Mini-game: given a target weight, tap the plates to load the bar as fast as possible. Leaderboard against yourself. Trains useful gym math skills. Frontend-only game mode."
  },
  {
    "id": "033",
    "title": "Form Check Reminder",
    "status": "backlog",
    "description": "Every N workouts at a given weight, nudge: 'You have been at 100kg bench for 6 sessions. Film a form check?' Links to camera. No AI analysis, just the reminder habit to encourage good form."
  },
  {
    "id": "014",
    "title": "Quick Rep Edit",
    "status": "backlog",
    "description": "Improve rep entry UX with bigger +/- buttons or a number spinner directly on set rows. Current entry feels like too many taps, especially with sweaty hands between sets."
  },
  {
    "id": "017",
    "title": "Set Completion Haptic",
    "status": "backlog",
    "description": "Vibration or sound feedback when a set is logged. Confirms the tap registered, especially useful with sweaty/chalky hands or dim screens."
  },
  {
    "id": "006",
    "title": "Workout Progress Indicator",
    "status": "backlog",
    "description": "Progress bar and set counter at top of workout page showing 'X / 17 sets completed'. Bar fills as sets complete, color transitions gray to blue to green. Frontend-only, derived from existing set data."
  },
  {
    "id": "018",
    "title": "Recent Workout Peek",
    "status": "backlog",
    "description": "Before starting a workout, show a summary of last session for that day: key weights and reps. Helps users mentally prepare and know what to expect."
  },
  {
    "id": "020",
    "title": "Set Weight Override",
    "status": "backlog",
    "description": "Override auto-calculated weight for individual sets during a workout. For when plates don't work out cleanly at your gym, or you want to be conservative on a bad day. Avoids having to change the TM for one-off adjustments."
  },
  {
    "id": "019",
    "title": "Custom TM Override",
    "status": "backlog",
    "description": "Manually adjust a training max with a reason note (e.g. deload reset, injury setback, form correction). Uses existing append-only TM history. Critical when auto-progression overshoots reality."
  },
  {
    "id": "016",
    "title": "Workout Duration",
    "status": "backlog",
    "description": "Track and display how long each workout took. Show duration badge on history calendar entries. Helps users plan gym visits around their schedule."
  },
  {
    "id": "005",
    "title": "Dark Mode",
    "status": "backlog",
    "description": "System-aware dark mode following device preference, with manual toggle in Settings (System/Light/Dark). Redefine existing CSS custom properties under data-theme attribute. Store preference in localStorage. Instant switch, no reload."
  },
  {
    "id": "010",
    "title": "Workout Notes",
    "status": "backlog",
    "description": "Optional free-text notes on workouts. 'Add note' link on workout page opens textarea (max 500 chars), auto-saves on blur. Notes shown in history detail view. Requires new DB column and API update."
  },
  {
    "id": "023",
    "title": "Failed Set Tracking",
    "status": "backlog",
    "description": "Explicitly mark a set as failed rather than just logging low reps. Track failure patterns across sessions. Surface warnings when consecutive failures on the same weight suggest a TM reset is needed."
  },
  {
    "id": "012",
    "title": "Exercise Substitution",
    "status": "backlog",
    "description": "Swap a plan exercise for an alternative per-session or permanently. Casual users need it when equipment is taken or they have minor soreness. Power users want same TM reference and set scheme preserved, with approved alternatives per exercise."
  },
  {
    "id": "008",
    "title": "PR Detection",
    "status": "backlog",
    "description": "Detect personal records in real-time during workouts. PR = more weight at same or higher rep count than ever before for that exercise. Show animated celebration banner on AMRAP completion. New backend endpoint for per-exercise records by rep count."
  },
  {
    "id": "013",
    "title": "Effort / RPE Logging",
    "status": "backlog",
    "description": "Log perceived effort after workouts or per-set. Simple mode: post-workout Easy/Good/Hard rating. Advanced mode: per-set RPE 1-10 scale. Track trends over time to detect under-recovery or peaking."
  },
  {
    "id": "015",
    "title": "Missed Workout Reschedule",
    "status": "backlog",
    "description": "When a user skips a planned workout day, prompt them: skip it and move on, or do it today? Removes guesswork about what to do after missing a session."
  },
  {
    "id": "004",
    "title": "Plate Calculator",
    "status": "backlog",
    "description": "Tap weight on any set to see plate breakdown per side. Greedy algorithm from heaviest plate down. Configurable bar weight and available plates in Settings. Frontend-only, no backend changes."
  },
  {
    "id": "011",
    "title": "Bodyweight Tracking",
    "status": "backlog",
    "description": "Log bodyweight (daily or per-session) with a trend line chart. Casual users want weekly weigh-ins to see if training is working. Power users want daily logging, strength-to-bodyweight ratios, and correlation with TM progression."
  },
  {
    "id": "022",
    "title": "Volume Load History",
    "status": "backlog",
    "description": "Track total volume load (sets x reps x weight) per exercise per session and chart it over time. Volume load is the best proxy for training stress and hypertrophy stimulus. Surfaces plateaus that raw TM numbers miss."
  },
  {
    "id": "021",
    "title": "Workout Schedule",
    "status": "backlog",
    "description": "Assign plan days to specific weekdays (e.g. Day 1 = Monday, Day 2 = Wednesday) and visualize upcoming sessions in the calendar. Set once, referenced often for planning rest days and travel."
  },
  {
    "id": "009",
    "title": "Deload Detection",
    "status": "backlog",
    "description": "Track AMRAP trends and suggest deload when user hits 0-1 reps on progression AMRAP for 3 consecutive workouts. Suggest 10% TM reduction with one-tap apply. New backend stall-check endpoint, no new DB tables needed."
  },
  {
    "id": "002",
    "title": "PWA + Offline",
    "status": "backlog",
    "description": "Convert to PWA for home screen install and offline support. Phase 1: service worker + cached assets via vite-plugin-pwa. Phase 2: IndexedDB for offline workout sessions with mutation queue and sync-on-reconnect. Large effort, phased rollout."
  },
  {
    "id": "029",
    "title": "Lift Personality Quiz",
    "status": "backlog",
    "description": "After 4+ weeks of data, generate a lifter personality based on patterns: 'The Grinder' (always hits exact reps), 'The Sandbagging Overachiever' (smashes AMRAPs), 'The Ghost' (disappears then PRs). Shareable personality card."
  },
  {
    "id": "030",
    "title": "Gym Bro Trash Talk",
    "status": "backlog",
    "description": "AI-generated motivational/trash-talk notifications before workout days. 'Your bench has been stuck at 80kg for 3 weeks. Are you even trying?' Adjustable sass level from encouraging to savage."
  },
  {
    "id": "028",
    "title": "Gym Soundtrack Mode",
    "status": "backlog",
    "description": "Detect tempo of music playing (via mic permission) and pulse the UI to the beat. Rest timer syncs to song endings. Pure vibes, experimental feature."
  }
]
