[
  {
    "id": "092",
    "title": "Fix WebKit E2E flakiness on CI",
    "status": "done",
    "description": "E2E tests fail on CI in WebKit: (1) achievements.spec.ts - completion dialog not found after clicking complete button, times out waiting for confirm dialog or Back to Dashboard link. (2) admin-plan-editor.spec.ts - page.goto encounters WebKit internal error. Likely WebKit-specific timing/stability issues in CI environment."
  },
  {
    "id": "089",
    "title": "Merge username and displayName into a single field",
    "status": "done",
    "description": "Currently User has both username (optional, unique) and displayName (required, not unique). For a workout tracker, a single required unique username field that serves as both the identifier and display name is simpler. Combine them: make username required and unique, remove displayName, use username everywhere displayName was used (UI display, friend lists, etc.). Update registration, settings, friend search, and all API responses."
  },
  {
    "id": "046",
    "title": "Flaky E2E: isVisible() snapshot check in rest-timer confirmSet loop",
    "status": "done",
    "description": "e2e/rest-timer.spec.ts line 79 uses isVisible() (point-in-time snapshot) inside a loop guard before skipRestButton.click(). If the timer banner appears a few ms after the check, the click is never reached. Pre-existing issue found during ticket 040 review."
  },
  {
    "id": "049",
    "title": "Fix UTC/local timezone inconsistency in date input max and calendar day comparison",
    "status": "done",
    "description": "The date input max attribute uses .toISOString().slice(0,10) (UTC) while WorkoutCalendar.handleDayClick compares dates in local time. For users east of UTC, after midnight UTC but before midnight local time, the max date could be set to yesterday while the calendar allows clicking today, causing an inconsistency. Both should use the same local-time date string (e.g., toLocaleDateString('en-CA'))."
  },
  {
    "id": "074",
    "title": "ReactionBar: block only the clicked emoji during pending mutation, not all emoji buttons",
    "status": "done",
    "priority": "low",
    "description": "When a mutation is pending, all 5 emoji buttons are disabled via mutation.isPending. Only the tapped emoji should be blocked. Prevents the user from reacting with a different emoji while one is in flight."
  },
  {
    "id": "080",
    "title": "Real-Time Notifications (SSE + Toast)",
    "status": "done",
    "doc": "docs/backlog/features/real-time-notifications.md"
  },
  {
    "id": "091",
    "title": "PWA bottom navbar touch targets too small — hard to tap",
    "status": "done",
    "description": "The bottom navigation bar in the PWA is too small, making it difficult to tap on mobile devices. Increase the height and touch target size of the bottom navbar to meet the 44px minimum touch target guideline."
  },
  {
    "id": "081",
    "title": "Push Notifications (Service Worker)",
    "status": "in-progress",
    "description": "Add push notifications via Web Push API so users get notified even when the app is in the background. Requires VAPID key generation, subscription management (store push subscriptions in DB), and service worker push event handler. Builds on top of ticket 080 (SSE + Toast) — reuse the same notification events but deliver via push when user is offline/backgrounded. Scope: VAPID setup, PushSubscription CRUD endpoint, sw.js push handler, opt-in UI. CONSTRAINT: Do not add any npm dependencies — implement everything using built-in Node.js crypto and native Web Push APIs."
  },
  {
    "id": "077",
    "title": "E2E streak test uses setDate (local) instead of setUTCDate for yesterday calculation — may produce wrong date near midnight in UTC-offset environments",
    "status": "backlog",
    "priority": "low",
    "description": "In e2e/social.spec.ts line 70, yesterday is computed with setDate(getDate() - 1) which uses local time. The streak calculation in the backend uses UTC. In UTC+N timezones, the local date could be one day ahead of UTC, causing the custom workout to be saved with the wrong UTC date and the streak test to fail near midnight. Should use setUTCDate / getUTCDate like the backend does."
  },
  {
    "id": "082",
    "title": "streak_milestone and badge_unlocked not emitted for custom workouts",
    "status": "backlog",
    "priority": "medium",
    "description": "The createCustomWorkout() path in workout.service.ts only creates a workout_completed feed event. It does not run the streak/badge logic that the two completeWorkout() paths run. Custom workouts can advance a streak and should trigger the same milestone checks."
  },
  {
    "id": "084",
    "title": "emit streak_milestone and badge_unlocked for custom workouts",
    "status": "backlog",
    "priority": "medium",
    "description": "createCustomWorkout() in workout.service.ts skips streak calculation and badge checking entirely. Users completing a custom workout that hits a streak milestone will not see a streak_milestone feed event. Requires extracting the shared emitStreakAndBadgeEvents() helper and calling it from createCustomWorkout path."
  },
  {
    "id": "085",
    "title": "streak_milestone deduplication has no DB-level uniqueness guarantee — concurrent completions can create duplicate events",
    "status": "backlog",
    "priority": "medium",
    "description": "The findFirst + create pattern inside the transaction prevents duplicate streak_milestone events under normal sequential execution, but does not protect against two concurrent completeWorkout calls racing in separate transactions for the same user. A unique partial index on (user_id, event_type, payload->>'days') would provide a hard guarantee at the database level."
  },
  {
    "id": "086",
    "title": "Extract emitStreakAndBadgeEvents helper to deduplicate completeWorkout transaction paths",
    "status": "backlog",
    "priority": "low",
    "description": "The streak + badge feed event emission block (~40 lines) is duplicated in both plan and no-plan completeWorkout transaction paths. Extract to a shared helper function."
  },
  {
    "id": "087",
    "title": "Backend PATCH /users/me rejects null username — cannot clear username once set",
    "status": "backlog",
    "priority": "high",
    "description": "The frontend settings page sends username: null when clearing, but updateSchema only accepts string | undefined. Zod rejects null with VALIDATION_ERROR (422). The fix is to add .nullable() to the username field in updateSchema."
  },
  {
    "id": "088",
    "title": "Docs: update api-endpoints.md and db-schema.md for username field and GET /api/social/search endpoint",
    "status": "backlog",
    "priority": "medium",
    "description": "Task 9 from ticket 068 was acknowledged as not done. Three docs need updating: api-endpoints.md needs GET /api/social/search and the updated POST /api/social/request; db-schema.md needs the username column in users; react-query-cache.md needs the social/search query key."
  },
  {
    "id": "070",
    "title": "Missing negative test for century-club achievement (low TM should not unlock)",
    "status": "backlog",
    "priority": "low",
    "description": "The achievements test suite has a positive test for century-club (bench TM=200) but no negative test confirming it does NOT trigger when all set weights are below 100 kg. The default benchTM=100 users (TM=90) could serve as a negative baseline."
  },
  {
    "id": "072",
    "title": "Missing negative test for century-club achievement",
    "status": "backlog",
    "priority": "low",
    "description": "Add explicit test asserting that century-club is NOT unlocked for sub-100kg TM users"
  },
  {
    "id": "050",
    "title": "Calendar improvements: selectable days with custom workout button",
    "status": "done",
    "description": "Users can click/select days in the calendar. After selecting a day, buttons appear below the calendar to add a custom workout for that date."
  },
  {
    "id": "048",
    "title": "Polish custom workout modal: pre-select clicked calendar day",
    "status": "done",
    "description": "When opening the custom workout modal from a calendar day, the date should be pre-filled with the clicked day so users don't have to pick it again."
  },
  {
    "id": "047",
    "title": "Custom free-form workout logging",
    "status": "done",
    "description": "Allow users to log ad-hoc gym sessions (not from a plan) directly from the calendar view. User can pick a date, add exercises (from existing exercise list), specify sets with reps and weight for each, and save. These custom workouts appear in the calendar and workout history for later review. Key requirements: (1) Add workout entry point from calendar day tap/click, (2) Exercise picker from existing exercises, (3) Per-set logging: weight (kg) and reps, (4) Save as a new workout type (e.g. status=custom or a flag) so it's distinguishable from plan-generated workouts, (5) View saved custom workouts in history/calendar."
  },
  {
    "id": "045",
    "title": "Social / Gym Buddy Features",
    "status": "done",
    "description": "Share workouts with friends, compare progress on the same plan, leaderboard, simple feed. Friend system, notifications (e.g. 'Your friend just hit a new Bench TM'). Multi-layer: DB (friend relationships, feed events), API (social endpoints), frontend (feed, profiles, friend management)."
  },
  {
    "id": "038",
    "title": "N+1 queries in workout completion logic",
    "status": "done",
    "description": "The completeWorkout service (workout.service.ts:354-406) runs individual Exercise.findUnique and TrainingMax.findFirst queries inside a loop over progression sets. Should batch-fetch all exercises and current TMs before the loop to avoid N+1."
  },
  {
    "id": "039",
    "title": "Missing database indexes on foreign keys",
    "status": "done",
    "description": "Several high-query foreign keys lack explicit indexes: TrainingMax needs @@index([userId, exerciseId]) for 'get current TM' queries (the @@unique includes effectiveDate which is less efficient for latest-TM lookups), Workout needs @@index([userId, createdAt]) for calendar/history queries, UserPlan needs @@index([userId]) for subscription lookups. These become important as data grows."
  },
  {
    "id": "040",
    "title": "Flaky E2E: replace waitForTimeout in rest-timer tests",
    "status": "done",
    "description": "rest-timer.spec.ts lines 87 and 111 use page.waitForTimeout(200) before asserting timer is not visible. This is a classic flakiness pattern. Replace with expect(restTimerBanner).not.toBeVisible() which polls automatically. Also line 98 uses page.locator('#rest-timer-enabled') instead of semantic getByRole locator."
  },
  {
    "id": "041",
    "title": "Unsafe error handling in frontend catch blocks",
    "status": "done",
    "description": "Multiple frontend files use catch (err: any) and access err.message without type checking: ExerciseFormModal.tsx:76, usePlanEditorState.ts:118, login.tsx:26-28. Should use 'err instanceof Error ? err.message : String(err)' pattern consistently. Also api/client.ts line 53 throws raw response body without wrapping in a proper Error - callers have to guess the shape."
  },
  {
    "id": "042",
    "title": "Inconsistent getUserId() usage in backend routes",
    "status": "done",
    "description": "Some routes use the getUserId(req) helper (which throws if userId is missing) while others access req.userId directly (which is typed as optional). Inconsistent files: users.ts:13,28 and trainingMaxes.ts:28,58 use raw req.userId. All authenticated routes should use getUserId(req) for consistency and runtime safety."
  },
  {
    "id": "043",
    "title": "Missing DATABASE_URL validation in db.ts",
    "status": "done",
    "description": "backend/src/lib/db.ts passes process.env.DATABASE_URL to PrismaPg without checking if it's defined. If the env var is missing, the error will come from deep inside PrismaPg with a cryptic message. Add an explicit check: if (\\!process.env.DATABASE_URL) throw new Error('DATABASE_URL environment variable is required')."
  },
  {
    "id": "044",
    "title": "Update CLAUDE.md: vitest fileParallelism is true not false",
    "status": "done",
    "description": "CLAUDE.md states 'Backend vitest.config.ts uses fileParallelism: false' but the actual config has fileParallelism: true. Either update the docs to match reality, or change the config to false if test isolation requires it. Currently setup.ts only disconnects in afterAll (no table truncation per file), so parallel execution may be intentional."
  },
  {
    "id": "021",
    "title": "Workout Schedule",
    "status": "done",
    "description": "Assign plan days to specific weekdays (e.g. Day 1 = Monday, Day 2 = Wednesday) and visualize upcoming sessions in the calendar. Set once, referenced often for planning rest days and travel."
  },
  {
    "id": "003",
    "title": "Progression Charts",
    "status": "done",
    "description": "New /progress page with charts: TM progression lines per lift, AMRAP performance scatter plot, workout frequency heatmap. Time range selector (1M/3M/6M/All). New backend endpoint for AMRAP history. Lightweight chart library (uPlot or similar)."
  },
  {
    "id": "024",
    "title": "Workout History Refinement",
    "status": "done",
    "description": "Improve the workout history view: better readability and visual design, ability to delete old workouts, and overall UI/UX polish. Current history is hard to read and lacks basic management features."
  },
  {
    "id": "001",
    "title": "Rest Timer",
    "status": "done",
    "description": "Configurable rest timer that auto-starts on set completion with countdown display, adjust/skip controls, and settings for duration."
  },
  {
    "id": "007",
    "title": "Screen Wake Lock",
    "status": "done",
    "description": "Keep screen on during active workouts using the Screen Wake Lock API. Auto-acquire on workout page mount, release on leave/complete. Re-acquire on visibilitychange for iOS. No UI needed, graceful no-op on unsupported browsers."
  },
  {
    "id": "025",
    "title": "Dynamic exercise list on Progress page",
    "status": "done",
    "description": "The Progress page currently hardcodes 4 exercises (Bench, Squat, OHP, Deadlift) in EXERCISE_CONFIGS. Make the exercise list dynamic, driven by the active plan's exercises. This way if a user subscribes to a plan with different exercises, the Progress page adapts automatically."
  },
  {
    "id": "026",
    "title": "Plan switch marker on progression chart",
    "status": "done",
    "description": "When a user switches plans, TM values may not be directly comparable (e.g. different TM percentages). Add a visual vertical marker on the progression chart showing when a plan switch occurred, so users understand context for any jumps or drops in TM values."
  },
  {
    "id": "019",
    "title": "Custom TM Override",
    "status": "done",
    "description": "Manually adjust a training max with a reason note (e.g. deload reset, injury setback, form correction). Uses existing append-only TM history. Critical when auto-progression overshoots reality."
  },
  {
    "id": "035",
    "title": "PWA support - installable to home screen",
    "status": "done",
    "description": "Add web app manifest (manifest.json) with app name, icons, theme color, display: standalone. Add minimal service worker for installability. Link manifest in index.html. Goal: be able to Add to Home Screen on iOS Safari and get a standalone app experience."
  },
  {
    "id": "027",
    "title": "Achievement Badges",
    "status": "done",
    "description": "Unlock badges for workout milestones. Examples: 'Century Club' (100kg lift), 'Iron Streak' (4 weeks no missed days), 'AMRAP King' (+5 reps on progression set), 'Sunrise Grinder' (workout before 7am). Shareable badge cards. Requires defining achievement criteria, detection logic, and a display page."
  },
  {
    "id": "058",
    "title": "Feed Event Reactions",
    "status": "done",
    "description": "React to friends' feed events with quick emoji reactions (fire, clap, skull, flexed bicep, etc.). Tap-to-react on any feed item. Reactions shown as small emoji row under the event. Low-friction social engagement without typing."
  },
  {
    "id": "056",
    "title": "Workout Streak Visibility",
    "status": "done",
    "description": "Show friends' current workout streaks on the friends list and in the feed. 'Chris is on a 12-day streak 🔥'. Streaks calculated from consecutive scheduled workout completions. Motivates casual users through social proof."
  },
  {
    "id": "054",
    "title": "Estimated 1RM Leaderboard",
    "status": "done",
    "description": "Leaderboard based on calculated e1RM from AMRAP sets using Epley formula (weight * (1 + reps/30)), not just static TMs. More dynamic and rewards actual performance. Could be a tab or toggle on the existing leaderboard."
  },
  {
    "id": "065",
    "title": "Richer Feed Event Types",
    "status": "done",
    "description": "Expand feed beyond workout_completed and tm_increased. New event types: streak_milestone (7/14/30/60/90 day streaks), badge_unlocked (from Achievement Badges #027), plan_switched, workout_note_shared. Makes the feed more varied and engaging."
  },
  {
    "id": "068",
    "title": "Find Friends by Username",
    "status": "done",
    "description": "Add optional username field to user profile (unique, alphanumeric + underscores). Allow sending friend requests by username instead of email. More natural for gym acquaintances where you wouldn't share email. Search with autocomplete."
  },
  {
    "id": "061",
    "title": "Shareable Workout Card",
    "status": "backlog",
    "description": "Generate a screenshot-ready card after completing a workout showing: exercises, top sets, total volume, PRs hit, workout duration. Styled with SetForge branding. Share via native share API or download as image. Great for Instagram stories."
  },
  {
    "id": "057",
    "title": "Nudge / Poke Friend",
    "status": "backlog",
    "description": "Send a 'get to the gym' nudge to a friend who hasn't trained in X days. One-tap from the friends list. Recipient sees it as a feed event or in-app notification. Rate-limited to 1 nudge per friend per day to prevent spam."
  },
  {
    "id": "062",
    "title": "User Profile Page",
    "status": "backlog",
    "description": "Public-ish profile page showing: display name, member since date, current plan, lift stats summary (current TMs or e1RMs), workout streak, badges earned, total workouts completed. Viewable by friends. Foundation for social identity in the app."
  },
  {
    "id": "051",
    "title": "Progression Race",
    "status": "backlog",
    "description": "Compare TM progression charts side-by-side with a friend over a selectable time range (30d/90d/all). Pick an exercise and see who's progressing faster. Visual overlay chart on the existing progress page or a dedicated comparison view."
  },
  {
    "id": "063",
    "title": "Invite Link for Friend Requests",
    "status": "backlog",
    "description": "Generate a unique invite link (e.g. setforge.app/invite/abc123) that auto-sends a friend request when the invitee registers. Easier than sharing email addresses. Link expires after 7 days or first use. Shareable via native share API."
  },
  {
    "id": "066",
    "title": "Feed Comments",
    "status": "backlog",
    "description": "Add short text comments on friends' feed events. Max 200 chars. Simple threaded view under the event. Enables actual conversation between gym buddies about specific workouts or PRs. Requires new DB model and API endpoints."
  },
  {
    "id": "064",
    "title": "PR Celebration Post",
    "status": "backlog",
    "description": "When a user hits a personal record (requires PR Detection #008), auto-generate a celebratory feed event with confetti animation. Shows the lift, weight, reps, and how it compares to previous best. Friends see it prominently in their feed."
  },
  {
    "id": "060",
    "title": "Gym Crew / Groups",
    "status": "backlog",
    "description": "Create a named group of friends (a 'crew') that shares its own leaderboard and activity feed. Good for real-life gym groups or online communities running the same plan. Crew has a name, members, shared leaderboard, and crew feed."
  },
  {
    "id": "052",
    "title": "Weekly Challenge",
    "status": "backlog",
    "description": "Auto-generated weekly goals between friends. Examples: 'who can hit more total reps this week', 'who completes all scheduled workouts first'. Challenges auto-start Monday, results shown Sunday. Opt-in per friend pair."
  },
  {
    "id": "059",
    "title": "Accountability Partner",
    "status": "backlog",
    "description": "Pair with one friend as an accountability partner. Both get notified when the other skips a scheduled workout day. Opt-in mutual agreement. Shows partner's schedule and completion status on your dashboard. Designed for casual users who need external motivation."
  },
  {
    "id": "067",
    "title": "Weekly Activity Digest",
    "status": "backlog",
    "description": "Weekly summary of friends' activity delivered as a feed event or dedicated view every Sunday. Shows: who trained most, biggest TM jumps, longest active streaks, total group volume. Gives casual users a reason to check in even if they don't open the app daily."
  },
  {
    "id": "034",
    "title": "Rage Quit Button",
    "status": "backlog",
    "description": "Bad day? Slam a big red button that discards the workout with a dramatic animation and a random encouraging quote. Uses existing soft-delete (discarded status) under the hood."
  },
  {
    "id": "032",
    "title": "Workout Wrapped",
    "status": "backlog",
    "description": "Monthly/yearly Spotify Wrapped-style summary. Total tonnage lifted, favorite day of week, longest streak, biggest PR, fun comparisons ('You lifted the equivalent of 3 Toyota Corollas this month'). Shareable summary cards."
  },
  {
    "id": "031",
    "title": "Plate Math Speed Challenge",
    "status": "backlog",
    "description": "Mini-game: given a target weight, tap the plates to load the bar as fast as possible. Leaderboard against yourself. Trains useful gym math skills. Frontend-only game mode."
  },
  {
    "id": "033",
    "title": "Form Check Reminder",
    "status": "backlog",
    "description": "Every N workouts at a given weight, nudge: 'You have been at 100kg bench for 6 sessions. Film a form check?' Links to camera. No AI analysis, just the reminder habit to encourage good form."
  },
  {
    "id": "014",
    "title": "Quick Rep Edit",
    "status": "backlog",
    "description": "Improve rep entry UX with bigger +/- buttons or a number spinner directly on set rows. Current entry feels like too many taps, especially with sweaty hands between sets."
  },
  {
    "id": "017",
    "title": "Set Completion Haptic",
    "status": "backlog",
    "description": "Vibration or sound feedback when a set is logged. Confirms the tap registered, especially useful with sweaty/chalky hands or dim screens."
  },
  {
    "id": "006",
    "title": "Workout Progress Indicator",
    "status": "backlog",
    "description": "Progress bar and set counter at top of workout page showing 'X / 17 sets completed'. Bar fills as sets complete, color transitions gray to blue to green. Frontend-only, derived from existing set data."
  },
  {
    "id": "018",
    "title": "Recent Workout Peek",
    "status": "backlog",
    "description": "Before starting a workout, show a summary of last session for that day: key weights and reps. Helps users mentally prepare and know what to expect."
  },
  {
    "id": "020",
    "title": "Set Weight Override",
    "status": "backlog",
    "description": "Override auto-calculated weight for individual sets during a workout. For when plates don't work out cleanly at your gym, or you want to be conservative on a bad day. Avoids having to change the TM for one-off adjustments."
  },
  {
    "id": "016",
    "title": "Workout Duration",
    "status": "backlog",
    "description": "Track and display how long each workout took. Show duration badge on history calendar entries. Helps users plan gym visits around their schedule."
  },
  {
    "id": "005",
    "title": "Dark Mode",
    "status": "backlog",
    "description": "System-aware dark mode following device preference, with manual toggle in Settings (System/Light/Dark). Redefine existing CSS custom properties under data-theme attribute. Store preference in localStorage. Instant switch, no reload."
  },
  {
    "id": "010",
    "title": "Workout Notes",
    "status": "backlog",
    "description": "Optional free-text notes on workouts. 'Add note' link on workout page opens textarea (max 500 chars), auto-saves on blur. Notes shown in history detail view. Requires new DB column and API update."
  },
  {
    "id": "023",
    "title": "Failed Set Tracking",
    "status": "backlog",
    "description": "Explicitly mark a set as failed rather than just logging low reps. Track failure patterns across sessions. Surface warnings when consecutive failures on the same weight suggest a TM reset is needed."
  },
  {
    "id": "012",
    "title": "Exercise Substitution",
    "status": "backlog",
    "description": "Swap a plan exercise for an alternative per-session or permanently. Casual users need it when equipment is taken or they have minor soreness. Power users want same TM reference and set scheme preserved, with approved alternatives per exercise."
  },
  {
    "id": "008",
    "title": "PR Detection",
    "status": "backlog",
    "description": "Detect personal records in real-time during workouts. PR = more weight at same or higher rep count than ever before for that exercise. Show animated celebration banner on AMRAP completion. New backend endpoint for per-exercise records by rep count."
  },
  {
    "id": "013",
    "title": "Effort / RPE Logging",
    "status": "backlog",
    "description": "Log perceived effort after workouts or per-set. Simple mode: post-workout Easy/Good/Hard rating. Advanced mode: per-set RPE 1-10 scale. Track trends over time to detect under-recovery or peaking."
  },
  {
    "id": "015",
    "title": "Missed Workout Reschedule",
    "status": "backlog",
    "description": "When a user skips a planned workout day, prompt them: skip it and move on, or do it today? Removes guesswork about what to do after missing a session."
  },
  {
    "id": "004",
    "title": "Plate Calculator",
    "status": "backlog",
    "description": "Tap weight on any set to see plate breakdown per side. Greedy algorithm from heaviest plate down. Configurable bar weight and available plates in Settings. Frontend-only, no backend changes."
  },
  {
    "id": "011",
    "title": "Bodyweight Tracking",
    "status": "backlog",
    "description": "Log bodyweight (daily or per-session) with a trend line chart. Casual users want weekly weigh-ins to see if training is working. Power users want daily logging, strength-to-bodyweight ratios, and correlation with TM progression."
  },
  {
    "id": "022",
    "title": "Volume Load History",
    "status": "backlog",
    "description": "Track total volume load (sets x reps x weight) per exercise per session and chart it over time. Volume load is the best proxy for training stress and hypertrophy stimulus. Surfaces plateaus that raw TM numbers miss."
  },
  {
    "id": "009",
    "title": "Deload Detection",
    "status": "backlog",
    "description": "Track AMRAP trends and suggest deload when user hits 0-1 reps on progression AMRAP for 3 consecutive workouts. Suggest 10% TM reduction with one-tap apply. New backend stall-check endpoint, no new DB tables needed."
  },
  {
    "id": "029",
    "title": "Lift Personality Quiz",
    "status": "backlog",
    "description": "After 4+ weeks of data, generate a lifter personality based on patterns: 'The Grinder' (always hits exact reps), 'The Sandbagging Overachiever' (smashes AMRAPs), 'The Ghost' (disappears then PRs). Shareable personality card."
  },
  {
    "id": "030",
    "title": "Gym Bro Trash Talk",
    "status": "backlog",
    "description": "AI-generated motivational/trash-talk notifications before workout days. 'Your bench has been stuck at 80kg for 3 weeks. Are you even trying?' Adjustable sass level from encouraging to savage."
  },
  {
    "id": "028",
    "title": "Gym Soundtrack Mode",
    "status": "backlog",
    "description": "Detect tempo of music playing (via mic permission) and pulse the UI to the beat. Rest timer syncs to song endings. Pure vibes, experimental feature."
  },
  {
    "id": "036",
    "title": "Rename app from nSuns to SetForge",
    "status": "done",
    "description": "Rename all user-facing surfaces: HTML title, PWA manifest, Layout header, SW cache name, E2E test assertions, and CLAUDE.md references"
  },
  {
    "id": "037",
    "title": "Validate URL params and query strings with Zod",
    "status": "backlog",
    "description": "Body validation is solid but params/query have gaps: (1) PATCH/DELETE /api/admin/exercises/:id have no isNaN check causing 500s, (2) All :id params allow 0 or negative values, (3) GET /api/workouts/history limit has no upper bound, (4) GET /api/workouts/calendar year has no range bounds, (5) PATCH /api/workouts/:id/sets/:setId never validates :id param. Fix: extend validate middleware or add Zod schemas for params/query on all routes."
  },
  {
    "id": "053",
    "title": "Head-to-Head Live Workout",
    "status": "backlog",
    "description": "Real-time workout comparison when two friends train the same plan day simultaneously. See each other's set completion progress live. Requires WebSocket or polling. Shows 'friend is on set 5/17' alongside your own progress."
  },
  {
    "id": "055",
    "title": "Strength Standards Comparison",
    "status": "backlog",
    "description": "Compare your lifts against population-level strength standards (beginner/intermediate/advanced/elite) based on bodyweight and sex. Uses well-known strength standard tables. Requires bodyweight input. Shows where you stand for each lift."
  },
  {
    "id": "069",
    "title": "QR Code Add Friend",
    "status": "backlog",
    "description": "Generate a personal QR code in the app that encodes your friend request link. Show it at the gym for someone to scan and instantly send a friend request. Uses invite link system (#063). No typing needed - just scan and connect."
  },
  {
    "id": "071",
    "title": "Update POST /api/workouts/:id/complete docs to mention newAchievements in response",
    "status": "done",
    "priority": "low",
    "description": "The docs/api-endpoints.md entry for POST /api/workouts/:id/complete still says 'returns { progressions: [...] }'. It should be updated to include newAchievements: [...] in the documented response shape after ticket 027 added achievements."
  },
  {
    "id": "073",
    "title": "Update POST /api/workouts/:id/complete docs to include newAchievements",
    "status": "backlog",
    "priority": "low",
    "description": "The complete endpoint now returns newAchievements field but api-endpoints.md was not updated to reflect this (fixed in 027)"
  },
  {
    "id": "075",
    "title": "Add backend test: user cannot react to their own feed event via direct API call",
    "status": "backlog",
    "priority": "low",
    "description": "The GET /feed endpoint only shows friends' events, so a user cannot see their own events in the UI. However the POST /feed/:eventId/react endpoint only checks friendIds, not event.userId \\!== callerId. A user who knows their own feedEventId can call the react endpoint on it. While the feed won't show their own event, it's an untested edge case. Add a backend test that verifies self-reaction returns 404."
  },
  {
    "id": "076",
    "title": "Add date range filter to streak query to avoid fetching all workout history",
    "status": "backlog",
    "priority": "medium",
    "description": "getStreaksForUsers in social.ts fetches every completed workout for the given user IDs with no date bound. A user with years of history causes a large scan on every GET /api/social/friends and GET /api/social/feed call. The streak only needs the most recent contiguous block; a WHERE completedAt >= NOW() - INTERVAL '365 days' (or similar) would cap the scan with no correctness impact."
  },
  {
    "id": "078",
    "title": "Add date range filter to streak query to avoid full history scan",
    "status": "backlog",
    "priority": "medium",
    "description": "getStreaksForUsers fetches all completed workouts with no date bound. Add completedAt gte filter (e.g. 366 days) to cap the scan, since no streak can be longer than a year."
  },
  {
    "id": "079",
    "title": "Fix E2E streak test to use setUTCDate for yesterday calculation",
    "status": "done",
    "priority": "low",
    "description": "E2E streak test uses setDate/getDate (local time) for yesterday but toISOString() returns UTC. Near midnight in UTC-offset timezones this produces the wrong date, causing the 2 day streak assertion to fail."
  },
  {
    "id": "083",
    "title": "docs/db-schema.md feed_events event_type list is missing streak_milestone, badge_unlocked, and plan_switched",
    "status": "done",
    "priority": "low",
    "description": "The db-schema.md feed_events documentation only lists workout_completed and tm_increased as event_type values. Three new event types added in ticket 065 (streak_milestone, badge_unlocked, plan_switched) are not reflected in the doc. Should be updated per CLAUDE.md documentation requirements."
  },
  {
    "id": "090",
    "title": "Flaky test: workout-feed-events.test.ts occasionally fails with 404 on POST /api/workouts",
    "status": "backlog",
    "priority": "medium",
    "description": "workout-feed-events.test.ts is flaky - sometimes returns 404 on POST /api/workouts during parallel test execution (likely a race condition in test setup). Second run passes. Investigate and fix test isolation."
  },
  {
    "id": "093",
    "title": "Fix VAPID public key format: /public-key endpoint should return raw EC point (65 bytes base64url) not SPKI DER (91 bytes) — browser PushManager.subscribe() rejects SPKI",
    "status": "backlog",
    "priority": "high",
    "description": "The GET /api/notifications/public-key endpoint returns the SPKI DER base64url (91 bytes) of the VAPID public key, but the Web Push API specification requires the applicationServerKey passed to PushManager.subscribe() to be the raw uncompressed EC point (65 bytes, 04||x||y). Real browsers will throw InvalidAccessError. The fix is to return the raw EC point from the endpoint, or convert it in the frontend. The E2E tests do not catch this because the mock subscribe() ignores the opts parameter entirely."
  },
  {
    "id": "094",
    "title": "Fix pushSubscribeResponseSchema mismatch: backend POST /subscribe returns { ok: true } but frontend schema expects { id, userId, endpoint, createdAt } causing ZodError on enable",
    "status": "backlog",
    "priority": "high",
    "description": "The pushSubscribeResponseSchema in frontend/src/api/schemas.ts defines { id, userId, endpoint, createdAt } but the actual backend response is { ok: true }. When subscribePush() calls pushSubscribeResponseSchema.parse(data), it throws a ZodError even on a successful 201 response. This propagates to handleEnable catch block and shows 'Failed to enable notifications' to the user. Fix: change the schema to z.object({ ok: z.boolean() }) to match the actual API, or change the backend to return the created subscription record."
  },
  {
    "id": "095",
    "title": "Add push_subscriptions table to docs/db-schema.md",
    "status": "backlog",
    "priority": "low",
    "description": "The push_subscriptions table added in migration 20260222155927_add_push_subscriptions is not documented in docs/db-schema.md. Add an entry: push_subscriptions: id, user_id (FK users CASCADE), endpoint (TEXT), p256dh (TEXT), auth (TEXT), created_at. Unique: (user_id, endpoint)."
  },
  {
    "id": "096",
    "title": "Push notification button touch targets use 2.75rem instead of project-standard 3rem",
    "status": "backlog",
    "priority": "low",
    "description": "PushNotificationSettings.module.css .actionBtn and .actionBtnSecondary use min-height: 2.75rem (44px at 16px base), but all other interactive elements in the project use min-height: 3rem per CLAUDE.md convention ('All interactive elements min 44px (3rem)'). Additionally 2.75rem is not on the 8-point grid (should be 2.5rem or 3rem). Update both button classes to use 3rem."
  }
]
