[
  {
    "id": "086",
    "title": "Extract emitStreakAndBadgeEvents helper to deduplicate completeWorkout transaction paths",
    "status": "backlog",
    "priority": "low",
    "description": "The streak + badge feed event emission block (~40 lines) is duplicated in both plan and no-plan completeWorkout transaction paths. Extract to a shared helper function."
  },
  {
    "id": "087",
    "title": "Backend PATCH /users/me rejects null username — cannot clear username once set",
    "status": "backlog",
    "priority": "high",
    "description": "The frontend settings page sends username: null when clearing, but updateSchema only accepts string | undefined. Zod rejects null with VALIDATION_ERROR (422). The fix is to add .nullable() to the username field in updateSchema."
  },
  {
    "id": "088",
    "title": "Docs: update api-endpoints.md and db-schema.md for username field and GET /api/social/search endpoint",
    "status": "backlog",
    "priority": "medium",
    "description": "Task 9 from ticket 068 was acknowledged as not done. Three docs need updating: api-endpoints.md needs GET /api/social/search and the updated POST /api/social/request; db-schema.md needs the username column in users; react-query-cache.md needs the social/search query key."
  },
  {
    "id": "070",
    "title": "Missing negative test for century-club achievement (low TM should not unlock)",
    "status": "backlog",
    "priority": "low",
    "description": "The achievements test suite has a positive test for century-club (bench TM=200) but no negative test confirming it does NOT trigger when all set weights are below 100 kg. The default benchTM=100 users (TM=90) could serve as a negative baseline."
  },
  {
    "id": "052",
    "title": "Calendar: selectedDateKey not cleared after workout deletion causes Add Custom Workout button to appear unsolicited",
    "status": "backlog",
    "priority": "medium",
    "description": "When a workout is deleted from history, selectedDateKey in history.tsx is not cleared. After the calendar refetches, the deleted day now has no workouts, so showAddCustomWorkoutButton becomes true and the button appears without user interaction. Fix: call setSelectedDateKey(null) in handleConfirmDelete."
  },
  {
    "id": "053",
    "title": "Clear selectedDateKey after custom workout is saved",
    "status": "backlog",
    "priority": "low",
    "description": "After saving a custom workout via the modal, selectedDateKey is not cleared in history.tsx. The Add Custom Workout button correctly disappears once calendarWorkouts refreshes, but the .selected highlight on the calendar day persists until the user clicks another day or changes month. Fix: call setSelectedDateKey(null) in handleCustomWorkoutSaved."
  },
  {
    "id": "061",
    "title": "Shareable Workout Card",
    "status": "backlog",
    "description": "Generate a screenshot-ready card after completing a workout showing: exercises, top sets, total volume, PRs hit, workout duration. Styled with SetForge branding. Share via native share API or download as image. Great for Instagram stories."
  },
  {
    "id": "057",
    "title": "Nudge / Poke Friend",
    "status": "backlog",
    "description": "Send a 'get to the gym' nudge to a friend who hasn't trained in X days. One-tap from the friends list. Recipient sees it as a feed event or in-app notification. Rate-limited to 1 nudge per friend per day to prevent spam."
  },
  {
    "id": "062",
    "title": "User Profile Page",
    "status": "backlog",
    "description": "Public-ish profile page showing: display name, member since date, current plan, lift stats summary (current TMs or e1RMs), workout streak, badges earned, total workouts completed. Viewable by friends. Foundation for social identity in the app."
  },
  {
    "id": "051",
    "title": "Progression Race",
    "status": "backlog",
    "description": "Compare TM progression charts side-by-side with a friend over a selectable time range (30d/90d/all). Pick an exercise and see who's progressing faster. Visual overlay chart on the existing progress page or a dedicated comparison view."
  },
  {
    "id": "063",
    "title": "Invite Link for Friend Requests",
    "status": "backlog",
    "description": "Generate a unique invite link (e.g. setforge.app/invite/abc123) that auto-sends a friend request when the invitee registers. Easier than sharing email addresses. Link expires after 7 days or first use. Shareable via native share API."
  },
  {
    "id": "064",
    "title": "PR Celebration Post",
    "status": "backlog",
    "description": "When a user hits a personal record (requires PR Detection #008), auto-generate a celebratory feed event with confetti animation. Shows the lift, weight, reps, and how it compares to previous best. Friends see it prominently in their feed."
  },
  {
    "id": "060",
    "title": "Gym Crew / Groups",
    "status": "backlog",
    "description": "Create a named group of friends (a 'crew') that shares its own leaderboard and activity feed. Good for real-life gym groups or online communities running the same plan. Crew has a name, members, shared leaderboard, and crew feed."
  },
  {
    "id": "052",
    "title": "Weekly Challenge",
    "status": "backlog",
    "description": "Auto-generated weekly goals between friends. Examples: 'who can hit more total reps this week', 'who completes all scheduled workouts first'. Challenges auto-start Monday, results shown Sunday. Opt-in per friend pair."
  },
  {
    "id": "059",
    "title": "Accountability Partner",
    "status": "backlog",
    "description": "Pair with one friend as an accountability partner. Both get notified when the other skips a scheduled workout day. Opt-in mutual agreement. Shows partner's schedule and completion status on your dashboard. Designed for casual users who need external motivation."
  },
  {
    "id": "067",
    "title": "Weekly Activity Digest",
    "status": "backlog",
    "description": "Weekly summary of friends' activity delivered as a feed event or dedicated view every Sunday. Shows: who trained most, biggest TM jumps, longest active streaks, total group volume. Gives casual users a reason to check in even if they don't open the app daily."
  },
  {
    "id": "034",
    "title": "Rage Quit Button",
    "status": "backlog",
    "description": "Bad day? Slam a big red button that discards the workout with a dramatic animation and a random encouraging quote. Uses existing soft-delete (discarded status) under the hood."
  },
  {
    "id": "032",
    "title": "Workout Wrapped",
    "status": "backlog",
    "description": "Monthly/yearly Spotify Wrapped-style summary. Total tonnage lifted, favorite day of week, longest streak, biggest PR, fun comparisons ('You lifted the equivalent of 3 Toyota Corollas this month'). Shareable summary cards."
  },
  {
    "id": "031",
    "title": "Plate Math Speed Challenge",
    "status": "backlog",
    "description": "Mini-game: given a target weight, tap the plates to load the bar as fast as possible. Leaderboard against yourself. Trains useful gym math skills. Frontend-only game mode."
  },
  {
    "id": "033",
    "title": "Form Check Reminder",
    "status": "backlog",
    "description": "Every N workouts at a given weight, nudge: 'You have been at 100kg bench for 6 sessions. Film a form check?' Links to camera. No AI analysis, just the reminder habit to encourage good form."
  },
  {
    "id": "014",
    "title": "Quick Rep Edit",
    "status": "backlog",
    "description": "Improve rep entry UX with bigger +/- buttons or a number spinner directly on set rows. Current entry feels like too many taps, especially with sweaty hands between sets."
  },
  {
    "id": "017",
    "title": "Set Completion Haptic",
    "status": "backlog",
    "description": "Vibration or sound feedback when a set is logged. Confirms the tap registered, especially useful with sweaty/chalky hands or dim screens."
  },
  {
    "id": "006",
    "title": "Workout Progress Indicator",
    "status": "backlog",
    "description": "Progress bar and set counter at top of workout page showing 'X / 17 sets completed'. Bar fills as sets complete, color transitions gray to blue to green. Frontend-only, derived from existing set data."
  },
  {
    "id": "018",
    "title": "Recent Workout Peek",
    "status": "backlog",
    "description": "Before starting a workout, show a summary of last session for that day: key weights and reps. Helps users mentally prepare and know what to expect."
  },
  {
    "id": "020",
    "title": "Set Weight Override",
    "status": "backlog",
    "description": "Override auto-calculated weight for individual sets during a workout. For when plates don't work out cleanly at your gym, or you want to be conservative on a bad day. Avoids having to change the TM for one-off adjustments."
  },
  {
    "id": "016",
    "title": "Workout Duration",
    "status": "backlog",
    "description": "Track and display how long each workout took. Show duration badge on history calendar entries. Helps users plan gym visits around their schedule."
  },
  {
    "id": "005",
    "title": "Dark Mode",
    "status": "backlog",
    "description": "System-aware dark mode following device preference, with manual toggle in Settings (System/Light/Dark). Redefine existing CSS custom properties under data-theme attribute. Store preference in localStorage. Instant switch, no reload."
  },
  {
    "id": "010",
    "title": "Workout Notes",
    "status": "backlog",
    "description": "Optional free-text notes on workouts. 'Add note' link on workout page opens textarea (max 500 chars), auto-saves on blur. Notes shown in history detail view. Requires new DB column and API update."
  },
  {
    "id": "023",
    "title": "Failed Set Tracking",
    "status": "backlog",
    "description": "Explicitly mark a set as failed rather than just logging low reps. Track failure patterns across sessions. Surface warnings when consecutive failures on the same weight suggest a TM reset is needed."
  },
  {
    "id": "012",
    "title": "Exercise Substitution",
    "status": "backlog",
    "description": "Swap a plan exercise for an alternative per-session or permanently. Casual users need it when equipment is taken or they have minor soreness. Power users want same TM reference and set scheme preserved, with approved alternatives per exercise."
  },
  {
    "id": "008",
    "title": "PR Detection",
    "status": "backlog",
    "description": "Detect personal records in real-time during workouts. PR = more weight at same or higher rep count than ever before for that exercise. Show animated celebration banner on AMRAP completion. New backend endpoint for per-exercise records by rep count."
  },
  {
    "id": "013",
    "title": "Effort / RPE Logging",
    "status": "backlog",
    "description": "Log perceived effort after workouts or per-set. Simple mode: post-workout Easy/Good/Hard rating. Advanced mode: per-set RPE 1-10 scale. Track trends over time to detect under-recovery or peaking."
  },
  {
    "id": "015",
    "title": "Missed Workout Reschedule",
    "status": "backlog",
    "description": "When a user skips a planned workout day, prompt them: skip it and move on, or do it today? Removes guesswork about what to do after missing a session."
  },
  {
    "id": "004",
    "title": "Plate Calculator",
    "status": "backlog",
    "description": "Tap weight on any set to see plate breakdown per side. Greedy algorithm from heaviest plate down. Configurable bar weight and available plates in Settings. Frontend-only, no backend changes."
  },
  {
    "id": "011",
    "title": "Bodyweight Tracking",
    "status": "backlog",
    "description": "Log bodyweight (daily or per-session) with a trend line chart. Casual users want weekly weigh-ins to see if training is working. Power users want daily logging, strength-to-bodyweight ratios, and correlation with TM progression."
  },
  {
    "id": "022",
    "title": "Volume Load History",
    "status": "backlog",
    "description": "Track total volume load (sets x reps x weight) per exercise per session and chart it over time. Volume load is the best proxy for training stress and hypertrophy stimulus. Surfaces plateaus that raw TM numbers miss."
  },
  {
    "id": "009",
    "title": "Deload Detection",
    "status": "backlog",
    "description": "Track AMRAP trends and suggest deload when user hits 0-1 reps on progression AMRAP for 3 consecutive workouts. Suggest 10% TM reduction with one-tap apply. New backend stall-check endpoint, no new DB tables needed."
  },
  {
    "id": "029",
    "title": "Lift Personality Quiz",
    "status": "backlog",
    "description": "After 4+ weeks of data, generate a lifter personality based on patterns: 'The Grinder' (always hits exact reps), 'The Sandbagging Overachiever' (smashes AMRAPs), 'The Ghost' (disappears then PRs). Shareable personality card."
  },
  {
    "id": "030",
    "title": "Gym Bro Trash Talk",
    "status": "backlog",
    "description": "AI-generated motivational/trash-talk notifications before workout days. 'Your bench has been stuck at 80kg for 3 weeks. Are you even trying?' Adjustable sass level from encouraging to savage."
  },
  {
    "id": "028",
    "title": "Gym Soundtrack Mode",
    "status": "backlog",
    "description": "Detect tempo of music playing (via mic permission) and pulse the UI to the beat. Rest timer syncs to song endings. Pure vibes, experimental feature."
  },
  {
    "id": "037",
    "title": "Validate URL params and query strings with Zod",
    "status": "backlog",
    "description": "Body validation is solid but params/query have gaps: (1) PATCH/DELETE /api/admin/exercises/:id have no isNaN check causing 500s, (2) All :id params allow 0 or negative values, (3) GET /api/workouts/history limit has no upper bound, (4) GET /api/workouts/calendar year has no range bounds, (5) PATCH /api/workouts/:id/sets/:setId never validates :id param. Fix: extend validate middleware or add Zod schemas for params/query on all routes."
  },
  {
    "id": "053",
    "title": "Head-to-Head Live Workout",
    "status": "backlog",
    "description": "Real-time workout comparison when two friends train the same plan day simultaneously. See each other's set completion progress live. Requires WebSocket or polling. Shows 'friend is on set 5/17' alongside your own progress."
  },
  {
    "id": "055",
    "title": "Strength Standards Comparison",
    "status": "backlog",
    "description": "Compare your lifts against population-level strength standards (beginner/intermediate/advanced/elite) based on bodyweight and sex. Uses well-known strength standard tables. Requires bodyweight input. Shows where you stand for each lift."
  },
  {
    "id": "069",
    "title": "QR Code Add Friend",
    "status": "backlog",
    "description": "Generate a personal QR code in the app that encodes your friend request link. Show it at the gym for someone to scan and instantly send a friend request. Uses invite link system (#063). No typing needed - just scan and connect."
  },
  {
    "id": "075",
    "title": "Add backend test: user cannot react to their own feed event via direct API call",
    "status": "backlog",
    "priority": "low",
    "description": "The GET /feed endpoint only shows friends' events, so a user cannot see their own events in the UI. However the POST /feed/:eventId/react endpoint only checks friendIds, not event.userId \\!== callerId. A user who knows their own feedEventId can call the react endpoint on it. While the feed won't show their own event, it's an untested edge case. Add a backend test that verifies self-reaction returns 404."
  },
  {
    "id": "076",
    "title": "Add date range filter to streak query to avoid fetching all workout history",
    "status": "backlog",
    "priority": "medium",
    "description": "getStreaksForUsers in social.ts fetches every completed workout for the given user IDs with no date bound. A user with years of history causes a large scan on every GET /api/social/friends and GET /api/social/feed call. The streak only needs the most recent contiguous block; a WHERE completedAt >= NOW() - INTERVAL '365 days' (or similar) would cap the scan with no correctness impact."
  },
  {
    "id": "090",
    "title": "Flaky test: workout-feed-events.test.ts occasionally fails with 404 on POST /api/workouts",
    "status": "backlog",
    "priority": "medium",
    "description": "workout-feed-events.test.ts is flaky - sometimes returns 404 on POST /api/workouts during parallel test execution (likely a race condition in test setup). Second run passes. Investigate and fix test isolation."
  },
  {
    "id": "093",
    "title": "Fix VAPID public key format: /public-key endpoint should return raw EC point (65 bytes base64url) not SPKI DER (91 bytes) — browser PushManager.subscribe() rejects SPKI",
    "status": "backlog",
    "priority": "high",
    "description": "The GET /api/notifications/public-key endpoint returns the SPKI DER base64url (91 bytes) of the VAPID public key, but the Web Push API specification requires the applicationServerKey passed to PushManager.subscribe() to be the raw uncompressed EC point (65 bytes, 04||x||y). Real browsers will throw InvalidAccessError. The fix is to return the raw EC point from the endpoint, or convert it in the frontend. The E2E tests do not catch this because the mock subscribe() ignores the opts parameter entirely."
  },
  {
    "id": "094",
    "title": "Fix pushSubscribeResponseSchema mismatch: backend POST /subscribe returns { ok: true } but frontend schema expects { id, userId, endpoint, createdAt } causing ZodError on enable",
    "status": "backlog",
    "priority": "high",
    "description": "The pushSubscribeResponseSchema in frontend/src/api/schemas.ts defines { id, userId, endpoint, createdAt } but the actual backend response is { ok: true }. When subscribePush() calls pushSubscribeResponseSchema.parse(data), it throws a ZodError even on a successful 201 response. This propagates to handleEnable catch block and shows 'Failed to enable notifications' to the user. Fix: change the schema to z.object({ ok: z.boolean() }) to match the actual API, or change the backend to return the created subscription record."
  },
  {
    "id": "095",
    "title": "Add push_subscriptions table to docs/db-schema.md",
    "status": "backlog",
    "priority": "low",
    "description": "The push_subscriptions table added in migration 20260222155927_add_push_subscriptions is not documented in docs/db-schema.md. Add an entry: push_subscriptions: id, user_id (FK users CASCADE), endpoint (TEXT), p256dh (TEXT), auth (TEXT), created_at. Unique: (user_id, endpoint)."
  },
  {
    "id": "096",
    "title": "Push notification button touch targets use 2.75rem instead of project-standard 3rem",
    "status": "backlog",
    "priority": "low",
    "description": "PushNotificationSettings.module.css .actionBtn and .actionBtnSecondary use min-height: 2.75rem (44px at 16px base), but all other interactive elements in the project use min-height: 3rem per CLAUDE.md convention ('All interactive elements min 44px (3rem)'). Additionally 2.75rem is not on the 8-point grid (should be 2.5rem or 3rem). Update both button classes to use 3rem."
  },
  {
    "id": "100",
    "title": "Extract STREAK_MILESTONES constant to module scope in workout.service.ts",
    "status": "backlog",
    "priority": "low",
    "description": "The array [7, 14, 30, 60, 90] is defined inline at three separate locations in workout.service.ts (lines 530, 614, 809). It should be a single module-level constant to avoid divergence if milestone thresholds ever change."
  },
  {
    "id": "102",
    "title": "docs/api-endpoints.md missing comment endpoints and commentCount field in feed",
    "status": "backlog",
    "priority": "medium",
    "description": "Three new endpoints (POST/GET/DELETE /api/social/feed/:eventId/comments) and the new commentCount field in GET /api/social/feed response are not documented in docs/api-endpoints.md. The notification type comment_received is also undocumented."
  },
  {
    "id": "103",
    "title": "Improve logging coverage across backend services",
    "status": "backlog",
    "description": "Fill gaps identified in logging analysis where entire subsystems are silent and client-facing errors go unrecorded. Specific improvements: 1) Add warn-level logging for validation failures (Zod errors) and route-level caught errors (400s, 409s). 2) Add debug-level logging in achievement, notification, and feed services. 3) Add Prisma query event logging for slow queries. 4) Log weight calculation steps at debug level."
  },
  {
    "id": "104",
    "title": "Audit frontend catch blocks for incorrect error message extraction",
    "status": "backlog",
    "description": "The register page used err.error.message instead of err.message to extract ApiError messages, causing generic fallback messages. Other catch blocks in settings.tsx, FriendsTab.tsx, and workout.$dayNumber.tsx use the same 'error' in err pattern but operate on raw response bodies (not ApiError). These should be audited to confirm they work correctly now that ApiError is used consistently via the api/client.ts layer."
  },
  {
    "id": "105",
    "title": "Calendar badge shows 0 for custom workouts",
    "status": "backlog",
    "description": "In WorkoutCalendar.tsx:219, when a single workout exists on a date, the badge displays dayNumber instead of the count. Custom workouts have dayNumber: 0, so the badge renders 0 instead of 1. Fix: handle dayNumber === 0 case, e.g. day.workouts[0]!.dayNumber || day.workouts.length."
  },
  {
    "id": "106",
    "title": "Custom workout modal: no error shown for future date",
    "status": "backlog",
    "description": "In CustomWorkoutModal, when a user manually edits the date input to a future date, the field gets native HTML5 invalid state (from max attribute) but there is no visible error message. The Save button silently stays disabled with no explanation. Add inline validation text like 'Date cannot be in the future' when the date input is invalid."
  },
  {
    "id": "108",
    "title": "Push notification click navigation",
    "status": "backlog",
    "description": "When a push notification is tapped, navigate the user to the relevant view in the app. Implementation:\n\n1. **Backend**: Add a `url` field to each push notification payload (include `feedEventId` in comment_received payload for deep-linking):\n   - `comment_received` → `/social/feed?event=<feedEventId>` (scroll to and highlight the specific feed event)\n   - `friend_request_received` → `/social/friends`\n   - `friend_request_accepted` → `/social/friends`\n   - `workout_completed` → `/social/feed`\n   - `badge_unlocked` → `/achievements`\n\n2. **Service worker (sw.js)**: Add a `notificationclick` event handler that:\n   - Closes the notification\n   - Reads `data.url` from the notification\n   - If an app window is already open, navigates it and focuses it\n   - Otherwise opens a new window at that URL\n\n3. **Frontend social page**: Convert tabs to proper sub-routes:\n   - Create route files: `social/feed.tsx`, `social/friends.tsx`, `social/leaderboard.tsx`\n   - `/social` redirects to `/social/feed` (default tab)\n   - Tab navigation uses `<Link>` / `<ButtonLink>` for proper anchor tags\n   - `social/feed.tsx` reads optional `?event=<id>` search param via `validateSearch`\n   - When `event` search param is present, scroll to that feed event and highlight it (e.g. brief CSS animation)\n\nBump service worker cache name to `setforge-v3` since behavior changes."
  },
  {
    "id": "110",
    "title": "ActionRow React button shows same 'React' label in both active and inactive state",
    "status": "backlog",
    "priority": "low",
    "description": "The button text reads 'React' whether the user has already reacted or not. When active it should say something like 'Remove' or 'Reacted' so the label conveys the action that will happen on press."
  },
  {
    "id": "111",
    "title": "Backend feed endpoint fetches ALL comments unbounded — add LIMIT or take-last-2 in DB query instead of in-memory slice",
    "status": "backlog",
    "priority": "medium",
    "description": "GET /api/social/feed batch-fetches ALL comments for up to 20 events with no LIMIT. In the worst case this could be thousands of rows. The backend should instead use a ranked subquery or window function to fetch only the 2 most recent comments per event at the DB level, not slice in memory."
  },
  {
    "id": "112",
    "title": "docs/api-endpoints.md: GET /api/social/feed response shape missing latestComments field",
    "status": "backlog",
    "priority": "low",
    "description": "The api-endpoints.md documentation for GET /api/social/feed still describes the response without the latestComments field added in ticket 109. The doc should be updated to reflect the new field so future developers know it is part of the contract."
  },
  {
    "id": "113",
    "title": "react-query-cache.md has stale references to ReactionBar.tsx and CommentModal — update to ActionRow.tsx",
    "status": "backlog",
    "priority": "low",
    "description": "In react-query-cache.md the invalidation table still refers to 'ReactionBar.tsx' and the query key table says 'CommentSection (inside CommentModal)'. Both components were deleted in ticket 109 — update to ActionRow.tsx and CommentSection.tsx respectively."
  },
  {
    "id": "118",
    "title": "Flaky E2E: admin-plan-editor unsaved changes warning test",
    "status": "backlog",
    "priority": "low",
    "description": "Test times out on Create Account button click in admin setup phase (webkit, intermittent)"
  }
]
