{
  "project": "nSuns 4-Day LP Workout Tracker",
  "branchName": "ralph/playwright-migration",
  "description": "Migrate frontend tests to Playwright E2E, update run_test.sh, remove frontend unit test infra, add start_local_env.sh",
  "userStories": [
    {
      "id": "US-034",
      "title": "Remove frontend unit test infrastructure",
      "description": "As a developer, I want to remove all frontend unit test files and dependencies so the project has a single, clear testing strategy.",
      "acceptanceCriteria": [
        "Delete frontend/src/__tests__/ directory (AuthContext.test.tsx, client.test.ts)",
        "Delete frontend/vitest.config.ts",
        "Remove devDependencies from frontend/package.json: @testing-library/jest-dom, @testing-library/react, jsdom, vitest",
        "Remove \"test\": \"vitest run\" script from frontend/package.json",
        "npm install succeeds from project root with no errors",
        "npm run build -w frontend still works",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": "Delete the files first, then edit package.json to remove deps and test script. Run npm install from root to clean up node_modules."
    },
    {
      "id": "US-035",
      "title": "Install and configure Playwright",
      "description": "As a developer, I want Playwright set up in the project so I can write E2E tests against the real app.",
      "acceptanceCriteria": [
        "Install @playwright/test as a devDependency in the root package.json (not in frontend or backend workspace)",
        "Create playwright.config.ts at project root with: baseURL http://localhost:5173, testDir e2e/, chromium-only, retries 0, screenshot on failure",
        "Create e2e/ directory at project root",
        "Add test-results/ and playwright-report/ to .gitignore",
        "npx playwright install chromium succeeds",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": "Install in root package.json using npm install -D @playwright/test -w treenisofta (or from project root without -w). Then run npx playwright install chromium to download browser binaries."
    },
    {
      "id": "US-036",
      "title": "Write E2E test - Registration and Login",
      "description": "As a developer, I want E2E tests for the auth flows so I can verify users can register and log in through the real UI.",
      "acceptanceCriteria": [
        "Create e2e/auth.spec.ts",
        "Test: register a new user with valid credentials -> redirected to setup page",
        "Test: register with duplicate email -> shows error message",
        "Test: login with valid credentials -> redirected to dashboard or setup",
        "Test: login with wrong password -> shows error message",
        "Test: logout -> redirected to login page",
        "Each test uses a unique email (timestamp-based) for isolation",
        "Tests use Playwright page fixture, no mocks"
      ],
      "priority": 3,
      "passes": false,
      "notes": "Use Date.now() in email addresses for uniqueness (e.g. test-1234567890@example.com). The app redirects to /setup if user has no TMs after login. Use page.goto('/register'), fill form fields, click submit, then waitForURL to verify redirect."
    },
    {
      "id": "US-037",
      "title": "Write E2E test - Training Max Setup",
      "description": "As a developer, I want E2E tests for the TM setup flow so I can verify users can enter their 1RMs and see computed training maxes.",
      "acceptanceCriteria": [
        "Create e2e/setup.spec.ts",
        "Test: new user sees setup page after first login (no TMs exist)",
        "Test: enter 4 x 1RM values, submit -> redirected to dashboard",
        "Test: dashboard shows computed TMs (90% of entered 1RMs)",
        "Tests register a fresh user as setup, then perform TM setup"
      ],
      "priority": 4,
      "passes": false,
      "notes": "Register user first, then verify redirect to /setup. Fill in 1RM fields for bench, squat, ohp, deadlift. After submit, verify redirect to dashboard and that TM values are displayed (90% of 1RMs, rounded to 2.5kg)."
    },
    {
      "id": "US-038",
      "title": "Write E2E test - Workout Session",
      "description": "As a developer, I want E2E tests for a full workout session so I can verify the core workout flow works end-to-end.",
      "acceptanceCriteria": [
        "Create e2e/workout.spec.ts",
        "Test: start a Day 1 workout from dashboard -> workout page shows T1 and T2 sets",
        "Test: complete sets by clicking -> sets marked as done",
        "Test: enter AMRAP reps on the AMRAP set",
        "Test: complete workout -> see progression result (TM change banner)",
        "Test registers a fresh user, sets up TMs, then runs a workout"
      ],
      "priority": 5,
      "passes": false,
      "notes": "Full setup flow: register -> setup TMs -> start Day 1 workout. The workout page should show 9 T1 sets (Bench Volume) and 8 T2 sets (OHP). Complete sets, enter AMRAP reps, then complete workout. Verify progression banner appears showing TM change."
    },
    {
      "id": "US-039",
      "title": "Write E2E test - Workout History",
      "description": "As a developer, I want E2E tests for the history page so I can verify past workouts are displayed correctly.",
      "acceptanceCriteria": [
        "Create e2e/history.spec.ts",
        "Test: after completing a workout, navigate to history page -> see the completed workout",
        "Test: workout entry shows day number, date, and completion status",
        "Test builds on a completed workout (register -> setup -> workout -> complete -> check history)"
      ],
      "priority": 6,
      "passes": false,
      "notes": "Reuse the same setup pattern: register -> setup TMs -> start+complete workout -> navigate to /history. Verify the completed workout appears in the list with correct day number and date."
    },
    {
      "id": "US-040",
      "title": "Write E2E test - Settings Page",
      "description": "As a developer, I want E2E tests for the settings page so I can verify users can update their preferences.",
      "acceptanceCriteria": [
        "Create e2e/settings.spec.ts",
        "Test: navigate to settings -> see current user info (display name, email, unit preference)",
        "Test: change unit preference from kg to lb -> saves successfully",
        "Test: change display name -> saves successfully",
        "Test registers a fresh user and sets up TMs before navigating to settings"
      ],
      "priority": 7,
      "passes": false,
      "notes": "Register user, set up TMs (so user lands on dashboard, not setup), then navigate to /settings. Verify display name and email are shown. Toggle unit preference, verify save confirmation. Change display name, verify save confirmation."
    },
    {
      "id": "US-041",
      "title": "Update run_test.sh to run Playwright E2E tests",
      "description": "As a developer, I want run_test.sh to run both backend tests and Playwright E2E tests in a single invocation.",
      "acceptanceCriteria": [
        "run_test.sh starts test Postgres container (existing behavior)",
        "run_test.sh waits for DB ready and runs migrations (existing behavior)",
        "run_test.sh runs backend integration tests (existing behavior)",
        "If backend tests pass: starts backend server (port 3001) and frontend dev server (port 5173) as background processes",
        "Waits for both servers to be ready via health check or port check",
        "Runs npx playwright test",
        "Cleanup trap kills background server processes and stops test DB container",
        "Backend server uses the test database URL and test JWT secret",
        "Script exits with non-zero code if any test phase fails"
      ],
      "priority": 8,
      "passes": false,
      "notes": "Start backend with: DATABASE_URL=$TEST_DB_URL JWT_SECRET=test-secret PORT=3001 NODE_ENV=test node dist/index.js &. Start frontend with: npm run dev -w frontend &. Wait for servers using curl retry loop on health endpoints. Kill background PIDs in cleanup trap. Must build backend first (npm run build -w backend) before starting it."
    },
    {
      "id": "US-042",
      "title": "Create start_local_env.sh script",
      "description": "As a developer, I want a single script to start the full local dev environment so I can quickly begin manual testing.",
      "acceptanceCriteria": [
        "start_local_env.sh at project root, executable (chmod +x)",
        "Creates or attaches to a tmux session named 'treenisofta'",
        "3 panes in a single tmux window: Pane 1 runs docker compose up, Pane 2 waits for DB then runs migrations and npm run dev -w backend, Pane 3 runs npm run dev -w frontend",
        "Script checks that tmux is installed, exits with helpful error if not",
        "If session already exists, attaches to it instead of creating duplicate",
        "Script is idempotent (running twice doesn't create duplicate sessions)"
      ],
      "priority": 9,
      "passes": false,
      "notes": "Use tmux new-session for first pane, then tmux split-window for panes 2 and 3. Use tmux select-layout even-vertical for equal pane sizes. Check for existing session with tmux has-session -t treenisofta. Pane 2 needs a sleep/retry loop waiting for postgres to be ready before running migrations."
    },
    {
      "id": "US-043",
      "title": "Update CLAUDE.md and project configuration",
      "description": "As a developer, I want CLAUDE.md and project config updated to reflect the new testing strategy.",
      "acceptanceCriteria": [
        "CLAUDE.md Testing section: remove mention of frontend unit tests",
        "CLAUDE.md Testing section: add Playwright E2E test info (location: e2e/, config: playwright.config.ts)",
        "CLAUDE.md Testing section: add note 'Do not write frontend unit tests. All frontend testing is done via Playwright E2E tests.'",
        "CLAUDE.md Commands section: document start_local_env.sh",
        ".gitignore includes Playwright artifacts (test-results/, playwright-report/)",
        "Typecheck passes"
      ],
      "priority": 10,
      "passes": false,
      "notes": "Update the Testing section and Commands section in CLAUDE.md. The .gitignore update may have been done in US-035 already — verify and add if missing."
    }
  ]
}
